{
    "version": "https://jsonfeed.org/version/1",
    "title": "Linux Impact",
    "description": "",
    "home_page_url": "https://linuximpact.com",
    "feed_url": "https://linuximpact.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "David Rutland"
    },
    "items": [
        {
            "id": "https://linuximpact.com/a-techcrunch-rss-feed-was-hijacked-in-2021-nobody-noticed/",
            "url": "https://linuximpact.com/a-techcrunch-rss-feed-was-hijacked-in-2021-nobody-noticed/",
            "title": "A TechCrunch RSS feed was hijacked in 2021. Nobody noticed.",
            "summary": "RSS feeds power the internet - The parts of it worth reading anyway. With a decent RSS reader, you can skim headlines or excepts, you can get the most important news on your favourite topics without ever having to visit the sites themselves. Feedburner is&hellip;",
            "content_html": "<p>RSS feeds power the internet - The parts of it worth reading anyway. With a decent RSS reader, you can skim headlines or excepts, you can get the most important news on your favourite topics without ever having to visit the sites themselves.</p>\n<p>Feedburner is a web feed management service founded in 2004, and offered custom RSS feeds and management tools to bloggers. There are were some huge advantages for websites using Feedsburner to power their feeds. Statistics and analytics, for example; browser-friendly versions instead of ugly XML files; email sign-up options.</p>\n<p>But relying on external services to provide feeds leaves readers vulnerable if the feed is taken over by a a squatter. Who wants their feeds full of affiliate spam, cruft, crap, and scams? No-one, that's who.</p>\n<p>But that's what happened to TechCrunch in 2021.</p>\n<h2 id=\"h-techcrunch-has-had-a-rocky-relationship-with-feedburner\">TechCrunch had a rocky relationship with FeedBurner</h2>\n<figure class=\"post__image\"><img  src=\"https://linuximpact.com/media/posts/55/bonfire.jpg\" alt=\"silhouette of a man in front of a blazing bonfire\" width=\"1680\" height=\"840\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/55/responsive/bonfire-xs.webp 300w ,https://linuximpact.com/media/posts/55/responsive/bonfire-sm.webp 480w ,https://linuximpact.com/media/posts/55/responsive/bonfire-md.webp 768w ,https://linuximpact.com/media/posts/55/responsive/bonfire-lg.webp 1024w ,https://linuximpact.com/media/posts/55/responsive/bonfire-xl.webp 1360w ,https://linuximpact.com/media/posts/55/responsive/bonfire-2xl.webp 1600w\"></figure>\n<p>Way back in 2005, TechCrunch, not yet a tech media powerhouse, was a \"weblog dedicated to obsessively profiling and reviewing every newly launched web 2.0 business and service\".</p>\n<p>Hosted on WordPress 1.5.1, Techcrunch was the place to go if you wanted to read about the launch of Google reviews, the proliferation of new search engines, or an explanation of what web2.0 actually was.</p>\n<p>They also had good things to say about the FeedBurner service:</p>\n<blockquote>\n<p>One reason a blog or website owner would want to use this is because it simplifies the RSS feed. The Feed URL for Techcrunch, for instance, is “http://feeds.feedburner.com/Techcrunch”, which is a much simpler format that standard RSS feeds.... And if a site can get most of its readers to use the single Feedburner feed, they can take advantage of the great statistics and tools to see where readers are coming from and what they are clicking on.</p>\n</blockquote>\n<p>We'd disagree that the TechCrunch FeedBurner URL is a simpler format, and a quick look on archive.org shows that the TechCrunch had two native feeds at the time: http://www.techcrunch.com/?feed=rss and <a href=\"http://www.techcrunch.com/?feed=atom.\">http://www.techcrunch.com/?feed=atom. </a></p>\n<p>Sure, the URLs contain a \"?\", but the overall length was shorter, and besides, links are for clicking, not for copying out by hand - but we digress. TechCrunch clearly preferred the FeedBurner service, most likely because, \"it can automatically add Google Adsense adds to your feeds, allowing you to easily generate revenue if you have a large enough audience\". </p>\n<p>TechCrunch switched to FeedBurner the following month. </p>\n<p>Google acquired FeedBurner in 2007, and by 2012, <a href=\"https://techcrunch.com/2012/09/28/the-feedburner-deathwatch-continues-google-kills-adsense-for-feeds/\" rel=\"noopener noreferrer nofollow\">TechCruch had the service on deathwatch</a>, after Google shuttered its adsense integration.</p>\n<blockquote>\n<p>Many publishers (including TechCrunch) rely on the service to publish their RSS feeds. It’s time to reconsider this as the writing is clearly on the wall.</p>\n</blockquote>\n<p>They didn't reconsider it though, and the TechCrunch Feedburner feed was regularly updated with every story and article until late 2021.</p>\n<h2 id=\"h-failing-to-heed-your-own-warning\">Failing to heed your own warning</h2>\n<figure class=\"post__image\"><img  src=\"https://linuximpact.com/media/posts/55/ears.jpg\" alt=\"A bearded man holding both hands up to his ears\" width=\"1680\" height=\"840\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/55/responsive/ears-xs.webp 300w ,https://linuximpact.com/media/posts/55/responsive/ears-sm.webp 480w ,https://linuximpact.com/media/posts/55/responsive/ears-md.webp 768w ,https://linuximpact.com/media/posts/55/responsive/ears-lg.webp 1024w ,https://linuximpact.com/media/posts/55/responsive/ears-xl.webp 1360w ,https://linuximpact.com/media/posts/55/responsive/ears-2xl.webp 1600w\"></figure>\n<p>We started subscribing to TechCrunch via RSS at some point in 2018 - somewhere around the time that TechCrunch was <a href=\"https://techcrunch.com/2018/04/07/rss-is-undead/\">loudly proclaiming</a> the death of RSS as a useful technology.</p>\n<p>We can't remember where we found the URL - the official feed on the main site was <a href=\"https://techcrunch.com/feed/\" rel=\"noopener noreferrer nofollow\">https://techcrunch.com/feed/</a> at the time. It was probably through search results or an aggregated list of cool feeds to follow. Either way, the official FeedBurner feed was ticking along nicely. Doubtless forgotten by the TechCrunch admins, but, like a dying postman in a post-apocalyptic world, dutifully updating RSS clients around the world with the latest on Silicon Valley startups, interesting innovations, and the imminent arrival of Web 3.0 (yawn).</p>\n<p>In <a href=\"https://techcrunch.com/2021/04/14/googles-feedburner-moves-to-a-new-infrastructure-but-loses-its-email-subscription-service/\" rel=\"noopener noreferrer nofollow\">April 2021</a>, TechCrunch reported that Google would soon move Feedburner to a new infrastructure, and once again plugged its own FeedBurner URL - at the same time noting that the upcoming changes had the potential to create a bit of a mess:</p>\n<blockquote>\n<p>And despite everything, shutting it down would probably break enough tools for publishers to create quite an uproar. The TechCrunch RSS feed, to which you are surely subscribed in your desktop RSS reader, is http://feeds.feedburner.com/TechCrunch/, after all.</p>\n</blockquote>\n<p>Yes. That was a live link, BTW.</p>\n<h2 id=\"h-the-confusion\">The confusion</h2>\n<figure class=\"post__image\"><img  src=\"https://linuximpact.com/media/posts/55/techcrunch_freshrss_feed.jpg\" alt=\"TechCrunch RSS feed as viewed through FreshRSS\" width=\"1680\" height=\"636\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/55/responsive/techcrunch_freshrss_feed-xs.webp 300w ,https://linuximpact.com/media/posts/55/responsive/techcrunch_freshrss_feed-sm.webp 480w ,https://linuximpact.com/media/posts/55/responsive/techcrunch_freshrss_feed-md.webp 768w ,https://linuximpact.com/media/posts/55/responsive/techcrunch_freshrss_feed-lg.webp 1024w ,https://linuximpact.com/media/posts/55/responsive/techcrunch_freshrss_feed-xl.webp 1360w ,https://linuximpact.com/media/posts/55/responsive/techcrunch_freshrss_feed-2xl.webp 1600w\"></figure>\n<p>We're not sure how exactly the FeedBurner infrastructure shift went down, but we're certain that as TechCrunch predicted, it was a shitshow, and yes, it did break publisher tools, despite <a href=\"https://support.google.com/feedburner/answer/10483501\">assurances from Google</a> that, \"All existing feeds will continue to serve uninterrupted\".</p>\n<p>Pruning the feeds on our <a href=\"https://linuximpact.com/freshrss-stay-safe-and-never-visit-another-website-again/\">fabulous self-hosted FreshRSS instance</a> last week, we noticed that we hadn't favourited any TechCrunch articles for a while. Our instance is set to purge content over a certain age unless it's been favourited.</p>\n<p>Historically we had liked, on average, one TechCrunch article per month enough to keep it permanently on our servers.</p>\n<p>Highlights include headlines such as \"We must end the era of adjunct surveillance\" from August 2021 at which we were outraged and disgusted, and \"Panic sells 20,000+ Playdate handhelds in under 20 minutes\" from a month earlier, about which we were delighted.</p>\n<p>Our last favourited TechCrunch article received over RSS was titled \"Amazon will pay you $10 in credit for your palm print biometrics\", at which we literally facepalmed (Boom!).</p>\n<p>After that there's nothing - at least nothing we've found engaging enough to keep.</p>\n<h2 id=\"h-under-new-management\">Under new management</h2>\n<p>An article from the TechCruch feed posted in October 2021 - a mere six months after TechCrunch's article on the upcoming Infrastructure changes was titled, \"China Could Be Exploiting Internet Security Process to Steal Data, Cyber Experts Warn\". It doesn't scan as being particularly Crunch-y, and although informative, it doesn't read quite right either. The article isn't engaging (but hey, who has a 100% hit rate?), and the byline is \"noreply@blogger.com\".</p>\n<figure class=\"post__image\"><img  src=\"https://linuximpact.com/media/posts/55/techcrunch_china_story.jpg\" alt=\"A news article with the headline: China Could Be Exploiting Internet Security Process to Steal Data, Cyber Experts Warn\" width=\"1680\" height=\"744\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/55/responsive/techcrunch_china_story-xs.webp 300w ,https://linuximpact.com/media/posts/55/responsive/techcrunch_china_story-sm.webp 480w ,https://linuximpact.com/media/posts/55/responsive/techcrunch_china_story-md.webp 768w ,https://linuximpact.com/media/posts/55/responsive/techcrunch_china_story-lg.webp 1024w ,https://linuximpact.com/media/posts/55/responsive/techcrunch_china_story-xl.webp 1360w ,https://linuximpact.com/media/posts/55/responsive/techcrunch_china_story-2xl.webp 1600w\"></figure>\n<p>The page it links to is on the now-defunct https://techncruncher.blogspot.com blog. Running the content through a free plagiarism detector, reveals that the exact same content is on dozens of sites, including the Freedom First Network - an alt-right leaning outlet that (on a random sampling of its other pages) views Democrats as facists, and has headlines such as \"Planned Parenthood is Selling the Bodies of Dead Babies to the CCP to Develop Bioweapons to Use Against Americans\", and \"Do Black people owe White people reparations for slavery\". We suspect this is where the story originated.</p>\n<p>Move forwards through the TechCrunch feed, and you'll see more plausible headlines. Some are tech-related such as, \"Most Frequently Asked Questions About NFTs(Non-Fungible Tokens)\"; some are typical of the kind of low-quality SEO fodder you'd find on other, tech-adjacent sites, such as \"Ginger VS Grammarly: Which Grammar Checker is Better in (2022) ?\" </p>\n<p data-pm-slice=\"1 1 []\">There's a tonne of pop culture and movie lists.</p>\n<figure class=\"post__image post__image--center\"><img  src=\"https://linuximpact.com/media/posts/55/cenobites.jpg\" alt=\"Supposed TechCrunch story: Hellraiser: The 5 Best &amp; 5 Worst Cenobites In The Whole Franchise\" width=\"1914\" height=\"958\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/55/responsive/cenobites-xs.webp 300w ,https://linuximpact.com/media/posts/55/responsive/cenobites-sm.webp 480w ,https://linuximpact.com/media/posts/55/responsive/cenobites-md.webp 768w ,https://linuximpact.com/media/posts/55/responsive/cenobites-lg.webp 1024w ,https://linuximpact.com/media/posts/55/responsive/cenobites-xl.webp 1360w ,https://linuximpact.com/media/posts/55/responsive/cenobites-2xl.webp 1600w\"></figure><figure class=\"post__image\"><img  src=\"Supposed techcruch story with the headline Hellraiser: The 5 Best &amp; 5 Worst Cenobites In The Whole Franchise\" alt=\"\" data-is-external-image=\"true\"></figure>\n<p>In February 2022, the linked domain moved to crunchhype.com, and the pop culture disappeared in favour of affiliate marketing and SEO based articles. Buried in there someone is, we would assume, an exhortation to take control of neglected RSS feeds to shill your stuff.</p>\n<h2 id=\"h-wider-implications-for-xxx\">There are wider implications for abandoned accounts</h2>\n<p>Websites live and die all the time, and their RSS feeds are taken over by squatters and legitimate new owners.</p>\n<p>The difference is that if a website of TechCrunch's size had died, we'd have heard about it and become suspicious that their feed was still coming through.</p>\n<p>TechCrunch is obviously still alive, and we had little reason to think that one of their official RSS channels had been taken over.</p>\n<p>Had the squatter's headline writers been better, we might have actually opened one of their spammy articles, and believed what was written therein.</p>\n<p>We don't know if you've heard the news, but Twitter will soon start selling disused handles in an effort to shore up the finances of Elon Musk's rapidly depopulating media empire.</p>\n<p>These are, presumably, accounts with a lot of followers, and the opportunity for plausible disinformation from people you'd forgotten you follow will be huge.</p>\n<p>Yes, the costs will be high, but consider that buying followers through promoted accounts costs around $2 per follower, we can see an incoming tsunami of shit.</p>",
            "image": "https://linuximpact.com/media/posts/55/techcrunch-banner-logo.jpg",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Security",
                   "RSS",
                   "Internet"
            ],
            "date_published": "2023-11-16T11:07:59+00:00",
            "date_modified": "2023-11-16T12:25:39+00:00"
        },
        {
            "id": "https://linuximpact.com/sudo-command-not-found-heres-an-easy-fix/",
            "url": "https://linuximpact.com/sudo-command-not-found-heres-an-easy-fix/",
            "title": "Sudo command not found? Here&#x27;s an easy fix",
            "summary": "Sudo is probably the most important command you'll ever use on Linux. It gives you god-like powers in the terminal, and the ability to do absolutely anything you want in the terminal (for good or evil). \"sudo: command not found\" isn't a common error, but&hellip;",
            "content_html": "<p data-pm-slice=\"1 1 []\">Sudo is probably the most important command you'll ever use on Linux. It gives you god-like powers in the terminal, and the ability to do absolutely anything you want in the terminal (for good or evil).</p>\n<p>\"sudo: command not found\" isn't a common error, but if you don't fix it, you won't be able to update packages, install software, or even perform basic maintanence.</p>\n<h2 id=\"h-what-is-the-sudo-command-used-for-on-linux\">What is the sudo command used for on Linux?</h2>\n<p>Unless you make a habit of logging into Linux as <strong>root</strong> (never a good idea), you have to preface any privileged command with <strong>sudo</strong>. Sudo gives you the mystical powers of a super user, and without it, you're more-or-less restricted to launching already installed applications, or creating and manipulating files in your <strong>home</strong> directory.</p>\n<p>For a complete description of what sudo can be used for and how to use it, enter the following command into a terminal:</p>\n<p><code>man sudo</code></p>\n<figure class=\"post__image post__image--center\"><img  src=\"https://linuximpact.com/media/posts/47/man-sudo.png\" alt=\"Man page entry for sudo\" width=\"1680\" height=\"924\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/47/responsive/man-sudo-xs.webp 300w ,https://linuximpact.com/media/posts/47/responsive/man-sudo-sm.webp 480w ,https://linuximpact.com/media/posts/47/responsive/man-sudo-md.webp 768w ,https://linuximpact.com/media/posts/47/responsive/man-sudo-lg.webp 1024w ,https://linuximpact.com/media/posts/47/responsive/man-sudo-xl.webp 1360w ,https://linuximpact.com/media/posts/47/responsive/man-sudo-2xl.webp 1600w\"></figure>\n<p>Without <strong>sudo</strong>, most of the filesystem will be inaccessible to you, and you won't be able to elevate your privilege to perform any restricted operations.</p>\n<p>In a recent analysis of <a href=\"https://linuximpact.com/discover-your-most-used-linux-commands-with-muc/\">most-used Linux commands</a> , we found <strong>sudo</strong> to be our third most used command overall.</p>\n<h2 id=\"h-why-is-the-the-sudo-command-not-found-where-did-sudo-go\">Why is the the sudo command not found? Where did sudo go?</h2>\n<p>Sudo <em>should</em> installed on most Linux systems when you set them up for the first time, and by default, the sudo binary is located in <strong>/usr/bin/sudo</strong>.</p>\n<p>We've seen the \"Sudo: Command Not Found\" message several times - usually after installing a new Linux system on a remote VPS or on a virtual machine.</p>\n<p>You can actual force this error by deleting sudo with:</p>\n<pre><code>sudo apt remove /usr/bin/sudo</code></pre>\n<p>...or by accidentally moving it to another location.</p>\n<p>Your first response on finding that sudo isn't installed might be to try and install sudo with:</p>\n<pre><code>sudo apt install sudo</code></pre>\n<p>Your terminal may even helpfully suggest that you use the above command. However, as you don't have sudo installed, you don't have the necessary privileges to install sudo.</p>\n<p>If you receive the error message: \"Sudo: Command Not Found\", the first thing you should do is check if <strong>sudo</strong> is present on your system.</p>\n<p>Open a terminal and enter:</p>\n<pre><code>ls /usr/bin/sudo</code></pre>\n<p>If sudo isn't present, you'll see the following message:<strong> ls: cannot access '/usr/bin/sudod': No such file or directory</strong>.</p>\n<h2 id=\"h-heres-the-simple-fix-for-sudo-command-not-found-on-linux\">Here's the simple fix for \"Sudo: Command Not Found\" on Linux</h2>\n<p>The root account on Linux doesn't need to use <strong>sudo</strong> in order to install packages, and fortunately, it's easy to get root access on your physical machine or VM.</p>\n<p>Restart Linux, either by selecting <strong>log out &gt; restart</strong> or simply <strong>restart</strong> from your power or system menu.</p>\n<p>Alternatively, power off your machine, then turn it on again.</p>\n<p>As soon as your PC starts to boot, press and hold <strong>shift</strong> or <strong>Escape</strong> to bring up the <strong>grub</strong> menu.</p>\n<p>Choose <strong>Advanced Options</strong> then select the most recent kernel version with <strong>Recovery mode</strong>.</p>\n<figure class=\"post__image post__image--center\"><img  src=\"https://linuximpact.com/media/posts/47/gnu-grub-advanced-menu-2.png\" alt=\"Gnu Grub advance menu with a recovery mode entry highlighted\" width=\"1680\" height=\"647\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/47/responsive/gnu-grub-advanced-menu-2-xs.webp 300w ,https://linuximpact.com/media/posts/47/responsive/gnu-grub-advanced-menu-2-sm.webp 480w ,https://linuximpact.com/media/posts/47/responsive/gnu-grub-advanced-menu-2-md.webp 768w ,https://linuximpact.com/media/posts/47/responsive/gnu-grub-advanced-menu-2-lg.webp 1024w ,https://linuximpact.com/media/posts/47/responsive/gnu-grub-advanced-menu-2-xl.webp 1360w ,https://linuximpact.com/media/posts/47/responsive/gnu-grub-advanced-menu-2-2xl.webp 1600w\"></figure>\n<p>Towards the bottom of the Recovery menu, you'll see an option to \"Drop to root shell prompt\". Select this.</p>\n<figure class=\"post__image\"><img  src=\"https://linuximpact.com/media/posts/47/ubuntu-recovery-menu-2.png\" alt=\"Grub system recovery menu with &quot;Drop to root shell prompt&quot; highlighted \" width=\"1680\" height=\"827\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/47/responsive/ubuntu-recovery-menu-2-xs.webp 300w ,https://linuximpact.com/media/posts/47/responsive/ubuntu-recovery-menu-2-sm.webp 480w ,https://linuximpact.com/media/posts/47/responsive/ubuntu-recovery-menu-2-md.webp 768w ,https://linuximpact.com/media/posts/47/responsive/ubuntu-recovery-menu-2-lg.webp 1024w ,https://linuximpact.com/media/posts/47/responsive/ubuntu-recovery-menu-2-xl.webp 1360w ,https://linuximpact.com/media/posts/47/responsive/ubuntu-recovery-menu-2-2xl.webp 1600w\"></figure>\n<p>Once in the root shell, you can install the sudo package, and add your user to the <strong>sudo</strong> group.</p>\n<p>On Debian, Ubuntu, and related distros:</p>\n<pre><code>apt install sudo\nusermod -aG sudo username</code></pre>\n<p>For Arch and derivatives such as Manjaro:</p>\n<pre><code>pacman -S sudo\nusermod -aG wheel username</code></pre>\n<figure class=\"post__image post__image--center\"><img  src=\"https://linuximpact.com/media/posts/47/root-shell.png\" alt=\"Installing sudo using the root shell\" width=\"1680\" height=\"544\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/47/responsive/root-shell-xs.webp 300w ,https://linuximpact.com/media/posts/47/responsive/root-shell-sm.webp 480w ,https://linuximpact.com/media/posts/47/responsive/root-shell-md.webp 768w ,https://linuximpact.com/media/posts/47/responsive/root-shell-lg.webp 1024w ,https://linuximpact.com/media/posts/47/responsive/root-shell-xl.webp 1360w ,https://linuximpact.com/media/posts/47/responsive/root-shell-2xl.webp 1600w\"></figure>\n<p>Make sure to replace <strong>username</strong> with the actual username of your usual user.</p>\n<p>You can now reboot as normal, and go about your day with full sudo powers!</p>\n<h2 id=\"h-the-power-of-sudo-at-your-fingertips\">The power of sudo at your fingertips</h2>\n<p>Sudo is a powerful tool, and it's easy to make a mistake on the command line. If sudo vanished due a mistyped command, such as accidentally moving the binary to another location, it's possible you may need to take more care when typing commands.</p>\n<p>Though they may not have helped in this specific case, there are tools that can assist with suggestions and help you <a href=\"https://linuximpact.com/quickly-rectify-time-consuming-terminal-typos-on-linux-with-thefuck/\">quickly remedy command line mistakes</a>.</p>",
            "image": "https://linuximpact.com/media/posts/47/sudo-command-not-found-cool-retro-terminal.png",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Tips",
                   "Terminal",
                   "Software",
                   "Linux",
                   "Help",
                   "Error",
                   "CLI"
            ],
            "date_published": "2023-11-15T11:36:47+00:00",
            "date_modified": "2023-11-15T22:56:28+00:00"
        },
        {
            "id": "https://linuximpact.com/sail-through-ubuntu-history-with-distrosea/",
            "url": "https://linuximpact.com/sail-through-ubuntu-history-with-distrosea/",
            "title": "Sail through Ubuntu history with DistroSea",
            "summary": "Everyone remembers their first experience with Linux. For some, it was a revelation, and a lifting of proprietary scales For others it was a confusing installation procedure, followed by bafflement as nothing was where it should be and it \"didn't look like Windows\". For most&hellip;",
            "content_html": "<p data-pm-slice=\"1 1 []\">Everyone remembers their first experience with Linux. For some, it was a revelation, and a lifting of proprietary scales</p>\n<p>For others it was a confusing installation procedure, followed by bafflement as nothing was where it should be and it \"didn't look like Windows\".</p>\n<p>For most people (by which we mean current Linux enthusiasts and users), that first experience was Ubuntu - thanks to its eye-catching design work, and its adherence to the AOL model of CD distribution. This author hasn't had an optical drive in half a decade but still possesses a stack of shiny Ubuntu coasters.</p>\n<p>Hard-headed tech nerds shouldn't get nostalgia, but we do, and it's often tempting to polish off the old bicycle and take a meandering trip down Memory Lane to revisit earlier incarnations of operating systems* we once knew, loved, and lauded as the greatest thing ever.</p>\n<p>But the official Ubuntu website only has downloads for version 20.04.06 onward, and while their <a href=\"https://old-releases.ubuntu.com/\" rel=\"noopener noreferrer nofollow\">old releases</a> subdomain stocks ISO images all the way back to 4.10 (Warty Warthog), downloads are slow, and it's a chore to set up an entire virtual machine just because you get teary-eyed for the biscuit-coloured wallpaper.</p>\n<h2 id=\"h-sail-the-high-distroseas\">Sail the high (Distro)Seas</h2>\n<figure class=\"post__image post__image--center\"><img  src=\"https://linuximpact.com/media/posts/46/distrosea-distros.jpg\" alt=\"logos for18 of the distrosea distros\" width=\"1680\" height=\"840\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/46/responsive/distrosea-distros-xs.webp 300w ,https://linuximpact.com/media/posts/46/responsive/distrosea-distros-sm.webp 480w ,https://linuximpact.com/media/posts/46/responsive/distrosea-distros-md.webp 768w ,https://linuximpact.com/media/posts/46/responsive/distrosea-distros-lg.webp 1024w ,https://linuximpact.com/media/posts/46/responsive/distrosea-distros-xl.webp 1360w ,https://linuximpact.com/media/posts/46/responsive/distrosea-distros-2xl.webp 1600w\"></figure>\n<p><a href=\"https://distrosea.com/\" target=\"_blank\" rel=\"noopener noreferrer\">DistroSea</a> came online in May 2023, and to date, offers 50 Linux distros and with a total of over 400 versions to play with in your browser. It's a cool tool you can use to get an idea of the look and feel of a distro before you go through the trouble of downloading and installing an ISO - although we wouldn't recommend using one of Distrosea's VMs as your daily driver.</p>\n<p>Don't get too excited just yet. If you're looking for rarities, you'll be disappointed. You won't find HJ Lu's seminal distro (appropriately called Distro) being spun up on a virtual 5.25\" floppy drive, nor 1992's GUI-tastic MCC Interim Linux. Even the Debian images only go back as far as Debian 10 (Buster).</p>\n<p>If you're a fan of antique Ubuntu desktops and can't wait to get your hands on some ancient simulated tech, you'll find that DistroSea has every release of Ubuntu, as well as the Xubuntu, Lubuntu, Kubuntu, Budgie, Kylin, mate, and Studio all the way back to Ubuntu 6.10 (Edgy Eft). OK, so it's not Warty Warthog, but Edgy Eft was released in October 2006.</p>\n<p>If you want some contextual landmarks for how long ago that really was, in October 2006 Google bought YouTube for a bargain $1.65 billion, Israel was in the process of de-occupying Lebanon, and the population of the United States was 34 million less than it is today.</p>\n<p>This writer's daughter was two months old, and tonight she's going to a concert in Manchester. 17 years is longer than you think.</p>\n<h2 id=\"h-trawling-the-distrosea-ocean\">Trawling the DistroSea ocean</h2>\n<figure class=\"post__image post__image--center\"><img  src=\"https://linuximpact.com/media/posts/46/latency.jpg\" alt=\"Graph showing distrosea availability and latency\" width=\"904\" height=\"400\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/46/responsive/latency-xs.webp 300w ,https://linuximpact.com/media/posts/46/responsive/latency-sm.webp 480w ,https://linuximpact.com/media/posts/46/responsive/latency-md.webp 768w ,https://linuximpact.com/media/posts/46/responsive/latency-lg.webp 1024w ,https://linuximpact.com/media/posts/46/responsive/latency-xl.webp 1360w ,https://linuximpact.com/media/posts/46/responsive/latency-2xl.webp 1600w\"></figure>\n<p>There are a few things you should be aware of when you spin up an image on DistroSea. The first is that you need to log in if you want to use the internet on these virtual machines. Logging in requires a Google account - anathema to privacy conscious Netizens.</p>\n<p>We imagine this is because if you get up to any no-good, immoral, or outright illegal highjinks, the person with the Google account is on the hook rather than the site owners.</p>\n<p>The second thing is latency. It's not bad, but it's definitely there - especially when the service is busy.</p>\n<figure class=\"post__image\"><img  src=\"https://linuximpact.com/media/posts/46/queueing-for-xubuntu.jpg\" alt=\"A screen with the xubuntu logo indicating the users place in the queue and estimated wait time\" width=\"1858\" height=\"816\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/46/responsive/queueing-for-xubuntu-xs.webp 300w ,https://linuximpact.com/media/posts/46/responsive/queueing-for-xubuntu-sm.webp 480w ,https://linuximpact.com/media/posts/46/responsive/queueing-for-xubuntu-md.webp 768w ,https://linuximpact.com/media/posts/46/responsive/queueing-for-xubuntu-lg.webp 1024w ,https://linuximpact.com/media/posts/46/responsive/queueing-for-xubuntu-xl.webp 1360w ,https://linuximpact.com/media/posts/46/responsive/queueing-for-xubuntu-2xl.webp 1600w\"></figure>\n<p>The third thing is the wait times. DistroSea is run on limited resources, and after clicking <strong>start</strong>, you'll be placed in a queue until there's an available slot. As far as we could ascertain from running <strong>top</strong> in the Ubuntu terminal, there are up to eight users per machine.</p>\n<p>Don't think about switching to another tab while you wait though. If you're more than (we'd guess) a minute AFK, you'll lose your place and the session will close.</p>\n<figure class=\"post__image\"><img  src=\"https://linuximpact.com/media/posts/46/eft-desktop.jpg\" alt=\"The edgy eft desktop with firefox, tetris and top running\" width=\"1680\" height=\"1260\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/46/responsive/eft-desktop-xs.webp 300w ,https://linuximpact.com/media/posts/46/responsive/eft-desktop-sm.webp 480w ,https://linuximpact.com/media/posts/46/responsive/eft-desktop-md.webp 768w ,https://linuximpact.com/media/posts/46/responsive/eft-desktop-lg.webp 1024w ,https://linuximpact.com/media/posts/46/responsive/eft-desktop-xl.webp 1360w ,https://linuximpact.com/media/posts/46/responsive/eft-desktop-2xl.webp 1600w\"></figure>\n<p>Edgy Eft was fun and kind of put things in perspective for the early Ubuntu landscape. In October 2006 when it was first released, the flagship Microsoft OS was Windows XP. In looks, usability, and customisation options alone, Ubuntu dominated utterly, and its superiority would only become more obvious with the release of Windows Vista the next month. MacOS meanwhile was on its \"Tiger\" release - all brushed metal and big icons.</p>\n<p>Our next stop on the nostaligia cruise was Ubuntu 12.04 LTS (Precise Pangolin) for the sole reason that this writer bought and immediately voided the warranty on a spanky new Dell Chromebook just to run Precise Pangolin.</p>\n<p>It was good despite some questionable design decisions, and is to our mind, the definitive Ubuntu release - although that could just be the way it looks through our rose-tinted glasses.</p>\n<h2 id=\"h-discover-buried-linux-treasure\">Discover buried Linux treasure</h2>\n<figure class=\"post__image post__image--center\"><img  src=\"https://linuximpact.com/media/posts/46/island.jpg\" alt=\"Man standing on a small island in an underground cave. A shaft of sunlight illuminates the sand behind him\" width=\"1680\" height=\"840\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/46/responsive/island-xs.webp 300w ,https://linuximpact.com/media/posts/46/responsive/island-sm.webp 480w ,https://linuximpact.com/media/posts/46/responsive/island-md.webp 768w ,https://linuximpact.com/media/posts/46/responsive/island-lg.webp 1024w ,https://linuximpact.com/media/posts/46/responsive/island-xl.webp 1360w ,https://linuximpact.com/media/posts/46/responsive/island-2xl.webp 1600w\"></figure>\n<p>Spinning up old distros brings to mind the best and worst of Linux has going for it, and the parts that fall into both camps.</p>\n<p>The fact that there are just so very many distros and so many ways of doing things points to what naysayers would call fragmention. And while that's sort-of technically true, it misses the point that open-source software allows you to do whatever you want to it, rebrand, and re-release. It's evolution, and the people who take part are passionate about it - which is a good thing.</p>\n<p>The kind of release schedule you get with Ubuntu - and Linux in general is fantastic too, and we get to try new things more often than users of other operating systems.</p>\n<p>Ubuntu is clearly the oldest distro available on DistroSea, but for a taste of not-quite-so-distant-past, it's also worth taking a sly gander at Slackware 14.0, which was released in September 2012, making it a mere month younger than the venerable and much maligned Windows 8.</p>\n<figure class=\"post__image post__image--center\"><img  src=\"https://linuximpact.com/media/posts/46/slackware-kde-widgets.jpg\" alt=\"Slackware linux with a variety of cool KDE widgets\" width=\"1680\" height=\"840\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/46/responsive/slackware-kde-widgets-xs.webp 300w ,https://linuximpact.com/media/posts/46/responsive/slackware-kde-widgets-sm.webp 480w ,https://linuximpact.com/media/posts/46/responsive/slackware-kde-widgets-md.webp 768w ,https://linuximpact.com/media/posts/46/responsive/slackware-kde-widgets-lg.webp 1024w ,https://linuximpact.com/media/posts/46/responsive/slackware-kde-widgets-xl.webp 1360w ,https://linuximpact.com/media/posts/46/responsive/slackware-kde-widgets-2xl.webp 1600w\"></figure>\n<p>As firm window manager enthusiasts, we'd forgotten all about KDE widgets, but DistroSea gave us a chance to play with desktop customisation via dragging widgets again. Fun times.</p>\n<p>Once you've reconciled your reminiscences, take a minute to use DistroSea as it was meant to be used: as a way to try out your next distro</p>\n<p>Indulge your curiosity with other distros like Big Linux (it isn't actually that big) See how the other half lives for an hour. Don't like systemd? try Devuan? Hate your boring, reliable Debian install, activate Arch for an afternoon.</p>\n<h2 id=\"h-will-distrosea-sink-or-swim\">Will DistroSea sink or swim?</h2>\n<p>DistroSea has been around for a few months now, but there's no guarantee it will be there forever.</p>\n<p>The developer and owner is <a href=\"https://old.reddit.com/user/basilky/\" rel=\"noopener noreferrer nofollow\">active on Reddit</a>, but is busy with work and other commitments, DistroSea appears to be a hobby project, but the resources it consumes are not trivial. We haven't been able to find a funding model, and we can only hope it doesn't disappear beneath the waves like its spiritual predecessor, DistroTest.</p>",
            "image": "https://linuximpact.com/media/posts/46/ubuntu-clocks.jpg",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Software",
                   "Distros"
            ],
            "date_published": "2023-11-14T17:44:01+00:00",
            "date_modified": "2023-11-14T19:32:12+00:00"
        },
        {
            "id": "https://linuximpact.com/set-up-your-own-xmpp-server-on-a-raspberry-pi-in-under-five-minutes/",
            "url": "https://linuximpact.com/set-up-your-own-xmpp-server-on-a-raspberry-pi-in-under-five-minutes/",
            "title": "Set up your own XMPP server on a Raspberry Pi in under five minutes",
            "summary": "Trust is a hard thing to come by in the 21st century, and relying on third party services to keep your private communications private is a mug's game. Right now, the most popular instant messaging app in the world is WhatsApp - a proprietary service&hellip;",
            "content_html": "<p data-pm-slice=\"1 1 []\">Trust is a hard thing to come by in the 21st century, and relying on third party services to keep your private communications private is a mug's game.</p>\n<p>Right now, the most popular instant messaging app in the world is WhatsApp - a proprietary service owned and operated by Meta - the company formerly know as FaceBook - that routinely coughs of <a href=\"https://duckduckgo.com/?t=ffab&amp;q=facebook+privacy+fines\">hundreds of millions in fines</a> to pay for its egregious privacy-related offences.</p>\n<p>In case you needed reminding, Facebook founder, Mark Zuckerberg, once referred to unsuspecting users who handed over their data to his nascent company as \"<a href=\"https://www.theregister.com/2010/05/14/facebook_trust_dumb/\" rel=\"noopener noreferrer nofollow\">dumb fucks</a>\". The Zuck's comments were made in 2004 - a more innocent time - but nearly two decades later, WhatsApp has more than 2 billion active users worldwide, sending 100 billion messages daily as well as making video calls, sending voice notes, and of cause, the ubiquitous duck-faced selfie.</p>\n<p>That's a lot of data to entrust to a company that makes its money from scraping up data about your life, tracking you across the internet (and in the real world), and then selling that data on.</p>\n<p>For us, it's not acceptable, and despite Meta's assurances that our data would be perfectly safe with them, we'd prefer not to take the risk. More to the point, we'd prefer a solution which kept our data and messages securely under our control.</p>\n<h2 id=\"h-wtf-is-snikket\">WTF is Snikket?</h2>\n<p>You've probably never heard of Snikket, and none of your friends use it either.</p>\n<p>Snikket is an easy-to-deploy XMPP (Extensible Messaging and Presence Protocol) server that can be up and running in virtually no time on a Raspberry Pi, VPS, or any random PC hardware you stumble across.<br><br>With Snikkett, you can create, own, and administer your own messaging service for friends, family, and casual acquaintances.</p>\n<p>By running an XMPP instance on your own hardware, you can install the Snikket app on your devices, and communicate with your other Snikket users without any danger of being snooped on by predatory corps, or other interested parties. You'll also have the option of sending your messages unencrypted, secured with OMEMO (OMEMO Multi-End Message and Object Encryption) multi-end to multi-end encryption, or classic OpenPGP.</p>\n<p>XMPP is capable of federating, meaning that users on your Snikket instance can communicate with users on any other XMPP instance, too. It's wild.</p>\n<p>As you'd expect from a modern messaging app, your communications aren't limited to texts like it's 1999, and you have the full gamut of mid 21st century functionality. Send kisses to your spouse, a voice note of everlasting adoration to your paramour, a dick pic to your side-piece, and apology videos to all of them.</p>\n<p>Snikket doesn't require much in the way of hardware to run, and a Raspberry Pi 4B will be ample for a family-sized instance. We've been running Snikket alongside an entire stable of self-hosted services including<a href=\"https://linuximpact.com/immich-is-the-killer-app-that-will-kick-start-the-self-hosting-revolution/\"> Immich</a>, <a href=\"https://linuximpact.com/self-host-your-own-audio-library-with-audiobookshelf/\">Audiobookshelf</a>, <a href=\"https://linuximpact.com/mealie-probably-the-best-self-hosted-recipe-manager-in-the-world/\">Mealie</a><a href=\"https://linuximpact.com/mealie-probably-the-best-self-hosted-recipe-manager-in-the-world/\"></a>, <a href=\"https://linuximpact.com/forget-net-nanny-pihole-will-keep-your-kids-late-night-activity-in-check/\">Pihole</a>, Jellyfin,Nextcloud, and more. We haven't encountered any problems at all.</p>\n<h2 id=\"h-how-to-install-snikket-on-your-raspberry-pi\">How to install Snikket on your Raspberry Pi</h2>\n<figure class=\"post__image post__image--center\"><img  src=\"https://linuximpact.com/media/posts/45/kitchen_pi-2.jpg\" alt=\"Silver-cased Raspberry Pi 4B on a granite kitchen counter \" width=\"1680\" height=\"840\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/45/responsive/kitchen_pi-2-xs.webp 300w ,https://linuximpact.com/media/posts/45/responsive/kitchen_pi-2-sm.webp 480w ,https://linuximpact.com/media/posts/45/responsive/kitchen_pi-2-md.webp 768w ,https://linuximpact.com/media/posts/45/responsive/kitchen_pi-2-lg.webp 1024w ,https://linuximpact.com/media/posts/45/responsive/kitchen_pi-2-xl.webp 1360w ,https://linuximpact.com/media/posts/45/responsive/kitchen_pi-2-2xl.webp 1600w\"></figure>\n<p>We're using the Raspberry Pi because a server needs to be on 24 hours per day, 365 days per year. It needs to be reliable, and ideally, shouldn't draw a huge amount of power. <a href=\"https://www.amazon.com/Raspberry-Pi-Computer-Suitable-Workstation/dp/B0899VXM8F/ref=sr_1_3?crid=16G7DHNEVDVBH&amp;keywords=raspberry+pi+8gb&amp;qid=1699266630&amp;sprefix=raspberry+pi+8gb%252Caps%252C152&amp;sr=8-3&amp;_encoding=UTF8&amp;tag=thecrowuk-20&amp;linkCode=ur2&amp;linkId=0f9dee46e8b8e6c27a2421c530833bac&amp;camp=1789&amp;creative=9325\" target=\"_blank\" rel=\"noopener noreferrer\">The Raspberry Pi 4B</a> pulls a mere 8 Watts - the equivalent of a low energy lightbulb, and reliability is improved by a pair of solid state drives (SSDs) in place of a failure-prone Micro SD card. Earlier models, such as the Raspberry Pi 2 and 3, can also run a Snikket instance without problems - although we haven't tried this ourselves.</p>\n<p>That said, these instructions should work on any computer hardware from the last 15 years that you happen to have lying around making the place look untidy.</p>\n<p>The <a href=\"https://snikket.org/service/quickstart/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">quickstart guide</a> on the Snikket website concisely sum up everything you need to get Snikket up and running in a hurry, although please do make sure that you read the linked page on which ports you need to open on your router and firewall.</p>\n<p>It's only if you're running Snikket behind a reverse proxy that you'll run into trouble.</p>\n<p>While the <a href=\"https://snikket.org/service/help/advanced/reverse_proxy/\" rel=\"noopener noreferrer nofollow\">Snikket Operators Guide</a> offers an exhaustive catalogue of reverse proxy example configs, you'll also need to make some changes to your docker-compose file - else Snikket will fail to initialise, and you'll see an endless stream of \"Waiting for certificates\" when you check the logs.</p>\n<p>After you use Let's Encrypt to obtain an SSL certificate for your main domain, you need to mount your certificates directory as a volume in both the <strong>snikket_server</strong> and <strong>snikket-proxy</strong> containers. While you have your docker-compose.yml open in nano, take the opportunity to nuke the <strong>snikket-proxy</strong> container, too.</p>\n<p>Our Snikket Docker Compose file looks like this:</p>\n<pre><code>version: \"3.3\"\n\nservices:\n  snikket_proxy:\n    container_name: snikket-proxy\n    image: snikket/snikket-web-proxy:beta\n    env_file: snikket.conf\n    network_mode: host\n    volumes:\n      - snikket_data:/snikket\n      - acme_challenges:/var/www/html/.well-known/acme-challenge\n      - /etc/letsencrypt:/snikket/letsencrypt\n    restart: \"unless-stopped\"\n\n  snikket_portal:\n    container_name: snikket-portal\n    image: snikket/snikket-web-portal:beta\n    network_mode: host\n    env_file: snikket.conf\n    restart: \"unless-stopped\"\n\n  snikket_server:\n    container_name: snikket\n    image: snikket/snikket-server:beta\n    network_mode: host\n    volumes:\n      - snikket_data:/snikket\n      - /etc/letsencrypt:/snikket/letsencrypt\n    env_file: snikket.conf\n    restart: \"unless-stopped\"\n\nvolumes:\n  acme_challenges:\n  snikket_data:\n</code></pre>\n<p>You also need to add the following lines to <strong>snikket.conf</strong>:</p>\n<pre><code>SNIKKET_TWEAK_HTTP_PORT=5080\nSNIKKET_TWEAK_HTTPS_PORT=5443</code></pre>\n<p>Start Snikket with:</p>\n<pre><code>docker-compose up -d</code></pre>\n<p>...and create an admin account link with:</p>\n<pre><code>docker exec snikket create-invite --admin --group default</code></pre>\n<p>That's it. Well done, open a browser, paste the link, and create the admin account on your server.</p>\n<p class=\"msg msg--highlight \">We found that using server aliases in our Apache conf file resulted in attached files such as photographs failing to be delivered. Setting up a seperate conf for the <strong>share</strong> subdomain, and deploying certbot against that solved the problem for us</p>\n<h2 id=\"h-connect-with-the-world-over-xmpp\">Connect with the world over XMPP!</h2>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://linuximpact.com/media/posts/45/gallery/linux_xmpp.jpeg\" data-size=\"1440x3168\"><img src=\"https://linuximpact.com/media/posts/45/gallery/linux_xmpp-thumbnail.webp\" alt=\"Results for XMPP Linux rooms\" width=\"768\" height=\"1690\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://linuximpact.com/media/posts/45/gallery/vidcall.jpeg\" data-size=\"1440x3168\"><img src=\"https://linuximpact.com/media/posts/45/gallery/vidcall-thumbnail.webp\" alt=\"A shaven-headed man conducting a video call with himself\" width=\"768\" height=\"1690\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://linuximpact.com/media/posts/45/gallery/lizziechat.jpg\" data-size=\"1440x3168\"><img src=\"https://linuximpact.com/media/posts/45/gallery/lizziechat-thumbnail.webp\" alt=\"A text chat between two people\" width=\"768\" height=\"1690\"></a></figure>\n</div></div>\n<p>Snikket has it's own mobile app which is available from <a href=\"https://f-droid.org/en/packages/org.snikket.android/\" rel=\"noopener noreferrer nofollow\">F-Droid</a>, <a href=\"https://play.google.com/store/apps/details?id=org.snikket.android\" rel=\"noopener noreferrer nofollow\">Google Play</a>, and Apple's <a href=\"https://apps.apple.com/gb/app/snikket/id1545164189\" rel=\"noopener noreferrer nofollow\">App store</a>. However, it will work perfectly well with any generic XMPP client, so if you already have a favourite, or prefer the UX of a different app, feel free to use that instead.</p>\n<p>Open the app, and you'll be asked to sign in. Your username is what you created during the admin setup, and will be in the format <strong>yourname@yourdomain.tld</strong>.</p>\n<p>The Snikket interface is kind of sparse. You have no contacts (unless the people in your contacts lists have XMPP addresses ), but you can add contacts, create private groups, and discover channels using the big plus sign in the lower right portion of the screen.</p>\n<p>And there are thousands of channels to join, so even if you have no friends in real life, you can still find people to talk to. A quick search for \"Linux\" yielded dozens of rooms dedicated to everything from Arch (BTW) to city-specific user groups. Of course, if you don't want to chat with the entire world, you can always decline to open port 5269. This will disable federation (there's probably another way to do it, but this sprung to mind as the most obvious).</p>\n<p>To add other users to your instance, open the web admin panel at <strong>your-domain.tld/admin/</strong>, then click <strong>Manage Users</strong>, and <strong>Create new invitation</strong>. Copy the link and send it by email, text. or carrier pigeon. Alternatively, you can generate a QR code on your mobile device for them to scan.</p>\n<p>Anyone who accepts your link will be automatically added as a contact, and as part of your circle. You can create and manage more circles through the admin panel.</p>\n<h2 id=\"h-using-snikket-with-friends-and-fam\">Using Snikket with friends and fam</h2>\n<p>As a privacy-oriented individual, this writer has had limited options when communicating with others. Autocrypted chat over email via <a href=\"https://linuximpact.com/delta-chat-going-old-school-with-the-future-of-messaging-apps/\">Delta Chat</a> has been pretty good for sending pictures, texts, and voice notes. But the options for self-hosted video and voice calls have been limited, and either resource hungry, or fairly involved to set up.</p>\n<p>Snikket changes that, and runs on extremely limited hardware. And you've already seen how very easy, and very quick it is to get up and running.</p>\n<p>Voice and video calls have been (so far), flawless, high quality, and trouble free, and it's genuinely a joy to use. We've been sending memes at midnight, making calls around the clock, sharing our location with the lads, and getting some quality face-to-face with friends. </p>\n<p>Bear in mind though, if you have a large number of users, and anticipate that they'll all be calling simulataneously, you may need to expand the port range.</p>\n<p>In addition to providing a first rate and effective messaging platform for the family unit, Snikket has opened up the world of XMPP. Thousands of channels, and yet more ways to waste time in the supermarket line.</p>\n<p>It's cool. You should <a href=\"https://snikket.org/\">check it out.</a></p>\n<p> </p>",
            "image": "https://linuximpact.com/media/posts/45/zuck.jpg",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Tips",
                   "Software",
                   "Self-hosted",
                   "Raspberry Pi",
                   "Privacy",
                   "Linux",
                   "Internet",
                   "DIY"
            ],
            "date_published": "2023-11-13T12:48:08+00:00",
            "date_modified": "2023-11-13T17:12:41+00:00"
        },
        {
            "id": "https://linuximpact.com/why-we-publish-with-publii-with-github-pages-its-trouble-free-and-its-actually-free/",
            "url": "https://linuximpact.com/why-we-publish-with-publii-with-github-pages-its-trouble-free-and-its-actually-free/",
            "title": "Why we publish with Publii and GitHub Pages: it&#x27;s trouble-free and it&#x27;s actually free",
            "summary": "Self-hosting sites and services from home is a pleasure and a joy - as well as being an all-consuming hobby that gives us more headaches than it should. The Raspberry Pi 4B is more than capable of providing extensive services for an extended family -&hellip;",
            "content_html": "<p data-pm-slice=\"1 1 []\">Self-hosting sites and services from home is a pleasure and a joy - as well as being an all-consuming hobby that gives us more headaches than it should.</p>\n<p>The <a href=\"https://www.amazon.com/Raspberry-Pi-Computer-Suitable-Workstation/dp/B0899VXM8F/ref=sr_1_3?crid=16G7DHNEVDVBH&amp;keywords=raspberry+pi+8gb&amp;qid=1699266630&amp;sprefix=raspberry+pi+8gb%252Caps%252C152&amp;sr=8-3&amp;_encoding=UTF8&amp;tag=thecrowuk-20&amp;linkCode=ur2&amp;linkId=0f9dee46e8b8e6c27a2421c530833bac&amp;camp=1789&amp;creative=9325\" target=\"_blank\" rel=\"noopener noreferrer\">Raspberry Pi 4B</a> is more than capable of providing extensive services for an extended family - furnishing them with an <a href=\"https://linuximpact.com/self-host-your-own-audio-library-with-audiobookshelf/\">Audiobook server</a>; streaming movies, shows, and music through Jellyfin; office suite and slot-in Drive replacement through courtesy of NextCloud; a <a href=\"https://social.rutland.org.uk/\" target=\"_blank\" rel=\"noopener noreferrer\">Fediverse</a> server (eschewed by everyone but this writer); Photo upload, and gallery with <a href=\"https://linuximpact.com/immich-is-the-killer-app-that-will-kick-start-the-self-hosting-revolution/\">Immich</a>, an email server and Snappymail frontend; and even more services that we can't recall right now.</p>\n<p>The humble Pi has even, in the past, been used to host public-facing websites.</p>\n<p>Hosting a website from home is a gratifying and traumatic experience, and your experience will vary depending on exactly how you decide to set it up.</p>\n<p><a href=\"https://thecrow.uk/\" target=\"_blank\" rel=\"noopener noreferrer\">The Crow</a> - a site now on semi-permanent hiatus, and from which several of the articles on Linux Imact were culled - was created as a static site using Jekyll. The writing was done in the Atom editor, and files were shuffled off onto the Pi using SCP (Secure Copy).</p>\n<p>Most of the time, the site ticked along happily, and was relatively unperturbed even under heavy traffic - one notable exception being when traffic to an article about <a href=\"https://thecrow.uk/A-Gov.uk-site-dedicated-to-porn-Absolutely/\" target=\"_blank\" rel=\"noopener noreferrer\">porn being hosted on a Department of Transport subdomain</a> forced the site onto a VPS for a short period.</p>\n<h2 id=\"h-wordpress-on-a-pi-isnt-always-the-optimal-solution\">WordPress on a Pi isn't always the optimal solution</h2>\n<p><a href=\"https://linuximpact.com\">Linux Impact</a> is younger than you may think - popping into existence after a domain name purchase on November 6th 2023, and certain decisions were made in an unconsidered rush.</p>\n<figure class=\"post__image\"><img  src=\"https://linuximpact.com/media/posts/42/old-linux-impact.jpg\" alt=\"An ugly Wordpress site with red and grey colour scheme\" width=\"1680\" height=\"774\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/42/responsive/old-linux-impact-xs.webp 300w ,https://linuximpact.com/media/posts/42/responsive/old-linux-impact-sm.webp 480w ,https://linuximpact.com/media/posts/42/responsive/old-linux-impact-md.webp 768w ,https://linuximpact.com/media/posts/42/responsive/old-linux-impact-lg.webp 1024w ,https://linuximpact.com/media/posts/42/responsive/old-linux-impact-xl.webp 1360w ,https://linuximpact.com/media/posts/42/responsive/old-linux-impact-2xl.webp 1600w\"></figure>\n<p>The first of these was to use WordPress as a content management system. WordPress is great software, and there's a reason it powers more than half of the websites online today.</p>\n<p>It was...fine. It's easy to get a website looking <em>OK</em> quickly, and there's no messing around with text editors.</p>\n<p>And everything worked well until we start getting decent amounts of traffic. After appearing on the HN front page, we were quickly forced offline - struggling under numbers that a static site would have handled with ease.</p>\n<p>Yes, we could have eased the burden by using a CDN to deliver images and other content from elsewhere on the web, and we did seriously consider doing exactly that.</p>\n<p>But once we arrived at the realisation that it wasn't entirely practical to completely host this website on a bargain basement SBC and a domestic internet connection, we started to wonder why we were hosting it at home in the first place.</p>\n<h2 id=\"h-making-better-design-decisions\">Making better design decisions</h2>\n<figure class=\"post__image\"><img  src=\"https://linuximpact.com/media/posts/42/designer.jpg\" alt=\"\" width=\"1680\" height=\"840\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/42/responsive/designer-xs.webp 300w ,https://linuximpact.com/media/posts/42/responsive/designer-sm.webp 480w ,https://linuximpact.com/media/posts/42/responsive/designer-md.webp 768w ,https://linuximpact.com/media/posts/42/responsive/designer-lg.webp 1024w ,https://linuximpact.com/media/posts/42/responsive/designer-xl.webp 1360w ,https://linuximpact.com/media/posts/42/responsive/designer-2xl.webp 1600w\"></figure>\n<p>The first decision we made was that <em>all</em><strong><em> </em></strong>content was going to be hosted offsite. <a href=\"https://pages.github.com/\" target=\"_blank\" rel=\"noopener noreferrer\">GitHub Pages</a> was the natural choice, as hosting is both free and fast - although there's an ever present nagging feeling that current owner, Microsoft, will, at some point, pull the rug and spiral into service enshitification.</p>\n<p>You can host any content you like on Github Pages. You can use your own domain name, and they'll even throw in SSL certs for free. It's pretty easy to set up, with the only proviso being that the content needs to be static. If you're hosting a web shop, or anything that requires users to sign in, static sites probably aren't for you anyway.</p>\n<p>While WordPress is excellent as a content management system, and it's possible to create a site using WorPress and export it as static pages, it's a bit fiddly for our tastes, and we've always found messing around with themes, layouts and widgets to be an annoyance rather than a feature.</p>\n<p>Jekyll was an option. Writing Markdown and creating sites with Jekyll is fun, but now that Atom, our favourite text editor has been archived, it's not as much fun as it used to be.</p>\n<figure class=\"post__image\"><img  src=\"https://linuximpact.com/media/posts/42/publii-marketplace.jpg\" alt=\"The Publii marketplace showing a selection of themes\" width=\"1680\" height=\"840\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/42/responsive/publii-marketplace-xs.webp 300w ,https://linuximpact.com/media/posts/42/responsive/publii-marketplace-sm.webp 480w ,https://linuximpact.com/media/posts/42/responsive/publii-marketplace-md.webp 768w ,https://linuximpact.com/media/posts/42/responsive/publii-marketplace-lg.webp 1024w ,https://linuximpact.com/media/posts/42/responsive/publii-marketplace-xl.webp 1360w ,https://linuximpact.com/media/posts/42/responsive/publii-marketplace-2xl.webp 1600w\"></figure>\n<p>Publii is a static site generator with all the bells and whistles you can imagine, and a for producing and editing posts, it's not all that different from the back-end of a WordPress blog: convenience, a variety of editors, a marketplace for themes and plugins. While our WordPress instance was periodically dropping offline and heroically resurfacing, we were able to port our meagre content into Publii, and get set up for free on GitHub.</p>\n<h2 id=\"h-creating-static-sites-is-simple-with-publii\">Creating static sites is simple with Publii</h2>\n<p>Publii is Free software licensed under GPL3. This means you can use it, distribute, modify, and redistribute with your own modifications (provided any modifications are distributed under the same license) however you want. You can buy, sell, and trade copies if you want - although that seems kind of pointless since the developers have made binaries for Windows, MacOS, and Linux available from the main <a href=\"https://getpublii.com/\" rel=\"noopener noreferrer nofollow\">Publii website</a>.</p>\n<p>Installation on our Debian-based system was as easy as popping a terminal and entering:</p>\n<pre><code>wget https://getpublii.com/download/Publii-0.44.0.deb\nsudo dpkg -i https://getpublii.com/download/Publii-0.44.0.deb</code></pre>\n<p>...and in a matter of minutes the app was installed and accessible from the system menu (it's a fairly hefty package, so the actual download took around 300 seconds ).</p>\n<figure class=\"post__image post__image--center\"><img  src=\"https://linuximpact.com/media/posts/42/publii-create-site.jpg\" alt=\"Create new site dialogue, showing icons, Site name and author name\" width=\"1680\" height=\"840\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/42/responsive/publii-create-site-xs.webp 300w ,https://linuximpact.com/media/posts/42/responsive/publii-create-site-sm.webp 480w ,https://linuximpact.com/media/posts/42/responsive/publii-create-site-md.webp 768w ,https://linuximpact.com/media/posts/42/responsive/publii-create-site-lg.webp 1024w ,https://linuximpact.com/media/posts/42/responsive/publii-create-site-xl.webp 1360w ,https://linuximpact.com/media/posts/42/responsive/publii-create-site-2xl.webp 1600w\"></figure>\n<p>Start Publii, and you'll be asked to accept the GNU GPL3 license then be asked to give your website a name, and choose a name for the primary author. You can also choose an adorable little icon to represent yourself and the site within Publii. We went with a steaming hot cup of coffee. Hit the big blue button and get started.</p>\n<p>This is where our experience most likely differed from most Publii users, because we weren't creating a website from scratch - we already had our struggling WordPress instance.</p>\n<p>Following the very well-written and understandable Publii instructions, we logged into WordPress, and from the admin panel clicked <strong>tools &gt; export</strong> to download an XML file containing posts, authors, category, and tag content. The file itself is only a few hundred kilobytes, so took only moments.</p>\n<p>Adding our exported content to Publii took longer. The process itself is simple, just click <strong>Tools &amp; Plugins &gt; WP Importer</strong>, then select the file you just downloaded. Publii will then download addition assets from your WordPress instance.</p>\n<p>As our WordPress site was failing under weight of numbers, this took a good hour, and when it was over, we breathed a sigh of relief.</p>\n<figure class=\"post__image\"><img  src=\"https://linuximpact.com/media/posts/42/publii-posts.jpg\" alt=\"Publii posts view showing titled posts stacked vertically\" width=\"1680\" height=\"719\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/42/responsive/publii-posts-xs.webp 300w ,https://linuximpact.com/media/posts/42/responsive/publii-posts-sm.webp 480w ,https://linuximpact.com/media/posts/42/responsive/publii-posts-md.webp 768w ,https://linuximpact.com/media/posts/42/responsive/publii-posts-lg.webp 1024w ,https://linuximpact.com/media/posts/42/responsive/publii-posts-xl.webp 1360w ,https://linuximpact.com/media/posts/42/responsive/publii-posts-2xl.webp 1600w\"></figure>\n<p data-pm-slice=\"1 1 []\">You'll find all of your posts under the <strong>Posts</strong> menu item on the left of the screen. Publii comes with a single theme installed - it's called <strong>Simple</strong>, and it looks pretty much how you'd expect. If you want more themes, check out the <a href=\"https://marketplace.getpublii.com/\" rel=\"noopener noreferrer nofollow\">Publii marketplace</a> for a selection of free and paid-for themes.</p>\n<p>We decided to go with <a href=\"https://marketplace.getpublii.com/themes/technews/\" rel=\"noopener noreferrer nofollow\">TechNews</a> - it's clean, it's smart, it's easily customised, and best of all for an experimental publication with a tight budget, it's free.</p>\n<p>Download the theme zip file to your local drive, click the three dots in the top right corner of Publii, click <strong>Themes</strong>, then <strong>Install Theme</strong>.</p>\n<p>To activate your new theme, Go to <strong>Site Settings</strong>, and select your new theme from the dropdown menu. Click on <strong>Save and Preview</strong> to have Publii generate the HTML for your site and open it in your default browser.</p>\n<p>We noticed that some of our code snippets weren't rendering properly, and a few of our header images hadn't downloaded and had to manually fix a few issues. It wasn't a big deal.</p>\n<p>In the <strong>Posts</strong> section, you'll see that you have a choice of editors, and depending on your previous experiences and preference, you can use Markdown, a word processor-ish WYSIWYG interface, or a very WordPress-like block editor.</p>\n<figure class=\"post__image\"><img  src=\"https://linuximpact.com/media/posts/42/wysiwyg-2.jpg\" alt=\"We've actually becoming unexpectedly attached to the WYSIWYG editor\" width=\"1680\" height=\"721\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/42/responsive/wysiwyg-2-xs.webp 300w ,https://linuximpact.com/media/posts/42/responsive/wysiwyg-2-sm.webp 480w ,https://linuximpact.com/media/posts/42/responsive/wysiwyg-2-md.webp 768w ,https://linuximpact.com/media/posts/42/responsive/wysiwyg-2-lg.webp 1024w ,https://linuximpact.com/media/posts/42/responsive/wysiwyg-2-xl.webp 1360w ,https://linuximpact.com/media/posts/42/responsive/wysiwyg-2-2xl.webp 1600w\"></figure>\n<p>Creating and editing a post is exactly what you're used to.</p>\n<p>Menus, were next and similarly simple to set up, a Matomo analytics plug-in, and we were ready to go.</p>\n<h2 id=\"h-uploading-linux-impact-to-github-pages\">Uploading Linux Impact to Github Pages</h2>\n<p>You'll need an account to use Github Pages, and fortunately for us, we already had one.</p>\n<p>Create a new repository, and a initialise a new branch for your static files (you can delete the master branch). Make sure you have Git installed on your local machine, and to make things a little easier <strong>GitHub Desktop</strong> can be useful as well.</p>\n<p>Once you've cloned the repo onto your local machine, it's simply a case of going to <strong>Server</strong> in Publii, giving your site a URL, and choosing the output type and directory. Handy hint: Don't use relative URLS or you won't get an RSS feed. Once that's done, hit <strong>Sync your Website</strong> to create the static files. Copy them over to your local GitHub repo, then push to origin.</p>\n<p>Your new static site will be accessible on Github (Our Github pages address is <a href=\"https://davidrutland.github.io/linuximpact\" rel=\"noopener noreferrer nofollow\">https://davidrutland.github.io/linuximpact</a>), but you probably want to use your own domain name.</p>\n<p>Visit your registrar, and enter a CNAME record with your Github pages address as the value eg: davidrutland.github.io.</p>\n<p>You'll also need to create four new <strong>A </strong>records, with <strong>@</strong> as the host, and the following values:</p>\n<ul>\n<li>\n<p>185.199.108.153</p>\n</li>\n<li>\n<p>185.199.109.153</p>\n</li>\n<li>\n<p>185.199.110.153</p>\n</li>\n<li>\n<p>185.199.111.153</p>\n</li>\n</ul>\n<p>Set the TTL as low as possible and save, then head back over to GitHub. Click <strong>Settings &gt; Pages</strong>,  and replace the yourname.github.io with your domain name. Wait for GitHub to run its checks, and make sure to click the <strong>Enforce HTTPS</strong> box.</p>\n<p>That's it. You're done, and provided you don't run into any issues, it's taken may half an hour.</p>\n<p>Any time you want to add or update a page, just press that <strong>Sync your Website</strong> button in Publii, and then use either Git in your terminal or Github desktop to update your site.</p>\n<p> </p>",
            "image": "https://linuximpact.com/media/posts/42/printing-press.jpg",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Tips",
                   "Software",
                   "Self-hosted",
                   "Raspberry Pi",
                   "Linux",
                   "Internet"
            ],
            "date_published": "2023-11-11T14:47:20+00:00",
            "date_modified": "2023-11-13T00:37:56+00:00"
        },
        {
            "id": "https://linuximpact.com/play-the-first-ever-text-adventure-game-in-your-linux-terminal/",
            "url": "https://linuximpact.com/play-the-first-ever-text-adventure-game-in-your-linux-terminal/",
            "title": "Play the first ever text adventure game in your Linux terminal!",
            "summary": "Back in the day, computers were serious machines for serious people doing serious things, and almost always reserved for the military, for banking, and for communications. They were huge, room-sized behemoths with capabilities that paled into insignificance next to even children's electronic toys from more&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>Back in the day, computers were serious machines for serious people doing serious things, and almost always reserved for the military, for banking, and for communications.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>They were huge, room-sized behemoths with capabilities that paled into insignificance next to even <a href=\"https://linuximpact.com/cheap-portable-retro-gaming-with-a-hated-handheld/\" data-type=\"post\" data-id=\"355\">children's electronic toys from more than a decade ago</a>.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>ARPANET (Advanced Research Projects Agency Network) was a project as serious as its name suggests and was the world's first distributed packet-switched network. It was designed to continue functioning even if parts of it were destroyed in a nuclear war, and would guarantee continued communication if the worst should happen.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:image {\"id\":387,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-387\"><img  src=\"https://linuximpact.com/media/posts/40/pdp-10-1-1024x512.jpg\" alt=\"a wall-sized computer with blinking lights and huge tape reels\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/40/responsive/pdp-10-1-1024x512-xs.webp 300w ,https://linuximpact.com/media/posts/40/responsive/pdp-10-1-1024x512-sm.webp 480w ,https://linuximpact.com/media/posts/40/responsive/pdp-10-1-1024x512-md.webp 768w ,https://linuximpact.com/media/posts/40/responsive/pdp-10-1-1024x512-lg.webp 1024w ,https://linuximpact.com/media/posts/40/responsive/pdp-10-1-1024x512-xl.webp 1360w ,https://linuximpact.com/media/posts/40/responsive/pdp-10-1-1024x512-2xl.webp 1600w\"></figure></figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>The project employed some of the brightest and most brilliant minds of the mid 20th century, and bright, brilliant people tend to get bored easily.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>While modern workers might surreptitiously open minesweeper or solitaire, computer games weren't really a thing in 1976. Sure, electronic<em> Tic Tac Toe</em> had been around since 1950, and <em>Spacewar!</em> arrived on the scene in 1962, but there was nothing really truly immersive.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>And so, Will Crowther - a keen Dungeons and Dragons fan and avid cave explorer, as well as having a career as a serious developer for ARPANET's very serious PDP-10 mainframe computer, designed and created Colossal Cave Adventure using FORTRAN IV.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>As the title suggests, the game takes place in a colossal cave (in reality, based on Kentucky's Mammoth cave ), filled with gold, treasure and enemies. The goal is simple: Find the treasures, defeat the enemies, and escape.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Crowther's base game was expanded on in 1977 by Stanford University hacker and programmer, Don Woods, who expanded the scenario and gameplay to include magical elements, dwarves, and further fantastical features.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Originally designed to be played on teletype printers, Colossal Cave Adventure describes the scene to you, and responds to typed commands.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Colossal Cave Adventure is rightfully regarded as one of the most influential games of all time, and spawned entire genres of derivative gaming experiences, as well as direct descendants including the classic Zork and Rogue.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-colossal-cave-adventure-in-the-modern-world\" class=\"wp-block-heading\">Colossal Cave Adventure in the modern world</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:image {\"id\":388,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-388\"><img  src=\"https://linuximpact.com/media/posts/40/colossal-cave-bear-1024x512.jpg\" alt=\"A large 3d bear with a collar and chain\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/40/responsive/colossal-cave-bear-1024x512-xs.webp 300w ,https://linuximpact.com/media/posts/40/responsive/colossal-cave-bear-1024x512-sm.webp 480w ,https://linuximpact.com/media/posts/40/responsive/colossal-cave-bear-1024x512-md.webp 768w ,https://linuximpact.com/media/posts/40/responsive/colossal-cave-bear-1024x512-lg.webp 1024w ,https://linuximpact.com/media/posts/40/responsive/colossal-cave-bear-1024x512-xl.webp 1360w ,https://linuximpact.com/media/posts/40/responsive/colossal-cave-bear-1024x512-2xl.webp 1600w\"></figure></figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>The game was an instant hit, and was released and re-released for a variety of platforms that didn't require building-sized infrastructure, Microsoft Adventure was published for Apple computers in 1979, with a version for IBM PCs following in 1981.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>In 2017, a mere 41 years after Colossal Cave Adventure's initial release, the game was made open source and uploaded to <a href=\"https://gitlab.com/esr/open-adventure\">GitLab</a>, spawning a number of remakes and reimaginings. In January 2023, a fully realised <a href=\"https://www.colossalcave3d.com/\" data-type=\"link\" data-id=\"https://www.colossalcave3d.com/\">3D version was announced by Cygnus Entertainment</a>.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>At Linux Impact, we're old school, and spend more time than is good for our eyesight and health staring into terminals.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>And lacking a teletype machine, the Linux terminal seems as good a place as any to reconnect with the roots of gaming.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-install-colossal-cave-adventure-on-linux\" class=\"wp-block-heading\">Install Colossal Cave Adventure on Linux</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p>Ready to commit entire months of your life to exploring an imaginary cave system in your terminal?</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>We've explored many iterations and versions of Colossal Cave Adventure (so that you don't have to), and determined Troglobit's <em>Adventure</em> to be the most reliably usable of the open source releases.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Open a terminal, then download and extract the latest archive:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>wget <a href=\"https://github.com/troglobit/adventure/releases/download/v4.2/advent-4.2.tar.gz\">https://github.com/troglobit/adventure/releases/download/v4.2/advent-4.2.tar.gz</a><br>tar xvf advent-4.2.tar.gz</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>This will create a new directory within your home directory. Move into it:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>cd advent-4.2</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>You'll be building the game from source, make sure you have <em>make</em>and a compiler such as gcc installed.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Build <em>Adventure</em> with:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>./configure<br>make</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>The game will install to<strong> /usr/local/bin</strong>, and the documents will end up in<strong> /usr/local/share</strong>.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>You can invoke the game's manual from the command line with:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>man adventure</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>...but as the six line document states, \"part of the game is to discover its rules\", so there's little help there.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Start the game by entering:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>adventure</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>into any terminal window.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>You can quit by typing:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>quit</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Or if you want to save your progress for later, type:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>suspend</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-playing-colossal-cave-adventure-in-the-21st-century\" class=\"wp-block-heading\">Playing Colossal Cave Adventure in the 21st century</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:image {\"id\":390,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-390\"><img  src=\"https://linuximpact.com/media/posts/40/collosal-cave-retro-1-1024x512.jpg\" alt=\"collosal cave adventure played using cool-retro-term on a 1980s style amber terminal\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/40/responsive/collosal-cave-retro-1-1024x512-xs.webp 300w ,https://linuximpact.com/media/posts/40/responsive/collosal-cave-retro-1-1024x512-sm.webp 480w ,https://linuximpact.com/media/posts/40/responsive/collosal-cave-retro-1-1024x512-md.webp 768w ,https://linuximpact.com/media/posts/40/responsive/collosal-cave-retro-1-1024x512-lg.webp 1024w ,https://linuximpact.com/media/posts/40/responsive/collosal-cave-retro-1-1024x512-xl.webp 1360w ,https://linuximpact.com/media/posts/40/responsive/collosal-cave-retro-1-1024x512-2xl.webp 1600w\"></figure></figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>OK. Let's start by saying that this is simultaneously one of the most enjoyable and frustrating gaming experiences we've had in a while. Cyberpunk 2077 it ain't.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>From the start, your options are limited, and you don't know what they are. You issue commands by typing a maximum of two words.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><strong>Look</strong> is the first command we figured out, and it gave us a written description of our environment. <strong>Take</strong>, <strong>Enter</strong>, and <strong>Eat</strong>, all have consequences, even if they're as trivial as seeing a \"your feet are now wet\" message after entering a stream.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>We've spent several hours exploring the colossal cave so far, and don't think we're even close to figuring out all the commands.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Yes, there are cheat sheets and maps available online, and we imagine there are walkthroughs available, too. But figuring things out as you go is a thrill all of its own, and a far cry from the tutorials and training levels of more modern games.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Later text adventures came with rudimentary graphics to illustrate your surroundings (this author's first video game experience was with the 1986 text graphical hybrid Escape From Khoshima), but the complete absence of any kind of visual clue or explicit instructions is part of the charm. It forces you to visualise your surroundings, draw maps with pen and paper, and keep extensive notes. It's a blast from the past, and somewhat similar to your computer acting as DM in a single player D&amp;D session.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>All in all, we're having a blast (from the past).</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-enhance-your-colossal-cave-experience-with-a-retro-terminal\" class=\"wp-block-heading\">Enhance your Colossal Cave experience with a retro terminal</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p>We don't have the equipment or budget to play Colossal Cave Adventure as it was originally meant to be played, but the right terminal emulator can at least give you the 1981 experience.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><a href=\"https://linuximpact.com/relive-the-glory-days-of-crt-monitors-with-cool-retro-term/\" data-type=\"post\" data-id=\"381\">cool-retro-term gives your terminal the look and feel of a console run on a CRT</a> from days gone by. You might be playing on an LCD or OLED screen, but with cool-retro-term, you get scan lines, fuzz, glitches, screen burn, and more.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Presets include Apple, IBM 3278, Monochrome Green, and IBM DOS.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>We don't have a time machine, but using cool-retro-term to play Colossal Cave Adventure is the next best thing.</p>\n<p><!-- /wp:paragraph --></p>",
            "image": "https://linuximpact.com/media/posts/40/colossal-ibm.jpg",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Terminal",
                   "Linux",
                   "Gaming",
                   "CLI"
            ],
            "date_published": "2023-11-09T20:59:38+00:00",
            "date_modified": "2023-11-10T16:56:31+00:00"
        },
        {
            "id": "https://linuximpact.com/relive-the-glory-days-of-crt-monitors-with-cool-retro-term/",
            "url": "https://linuximpact.com/relive-the-glory-days-of-crt-monitors-with-cool-retro-term/",
            "title": "Relive the glory days of CRT monitors with cool-retro-term",
            "summary": "Cathode ray tube televisions dominated household lounges from the beginnings of television in the early 20th century, to the widespread adoption of LCD displays in the early 21st. Most people's first experience of any kind of computer would have involved using a coaxial cable to&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>Cathode ray tube televisions dominated household lounges from the beginnings of television in the early 20th century, to the widespread adoption of LCD displays in the early 21st.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Most people's first experience of any kind of computer would have involved using a coaxial cable to connect an early console or home computer to the back of the family television.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Even if you were an early adopter of the fabulously expensive 'personal computers' that could be used at home, you still would have plugged it into a CRT monitor.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-cool-retro-term-is-a-time-machine-for-your-terminal\" class=\"wp-block-heading\">Cool Retro Term is a time machine for your terminal</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:image {\"id\":395,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-395\"><img  src=\"https://linuximpact.com/media/posts/39/a1200-1024x512.jpg\" alt=\"Amiga 1200 with a CRT monitor playing Bomb Jack\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/39/responsive/a1200-1024x512-xs.webp 300w ,https://linuximpact.com/media/posts/39/responsive/a1200-1024x512-sm.webp 480w ,https://linuximpact.com/media/posts/39/responsive/a1200-1024x512-md.webp 768w ,https://linuximpact.com/media/posts/39/responsive/a1200-1024x512-lg.webp 1024w ,https://linuximpact.com/media/posts/39/responsive/a1200-1024x512-xl.webp 1360w ,https://linuximpact.com/media/posts/39/responsive/a1200-1024x512-2xl.webp 1600w\"></figure></figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>The humble CRT monitor has an enduring place in pop culture, and aside for in the nostalgia for your own lost youth, they appear as central to the plot in a huge range of cinematic and cultural classics.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>The project aims to transport you to a simpler time and place, when a computer's memory was measured in kilobytes, and having to adjust vertical scanning to get a clear image was a daily chore, and you occasionally needed to physically whack your hardware to get it to behave.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>cool-retro-term is lightweight and immensely customisable to help you get the exact retro look and feel you're searching for.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>As well as coming with presets such as IBM, Apple, monochrome green, and futuristic, you can also configure cool retro term with visual artefacts common to technology of the last century to make your session more immersive.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-install-cool-retro-term-on-linux\" class=\"wp-block-heading\">Install cool Retro Term on Linux</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p>cool-retro-term is available is the standard repositories for most distros.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>To install cool-retro-term of Arch and its kin enter:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>sudo pacman -S cool-retro-term</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Or for Debian and derivatives:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>sudo apt install cool-retro-term</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>For Fedora and friends:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>sudo dnf install cool-retro-term</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Alternatively, you can install cool-retro-term using the AppImage:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>wget https://github.com/Swordfish90/cool-retro-term/releases/download/continuous/Cool_Retro_Term-dac2b4f-x86_64.AppImage</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Make it executable with:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>sudo chmod +x cool-retro-term/releases/download/continuous/Cool_Retro_Term-dac2b4f-x86_64.AppImage</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>...and launch with:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>./Cool_Retro_Term-dac2b4f-x86_64.AppImage</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-fine-tune-your-of-vintage-computing-terminal-experience\" class=\"wp-block-heading\">Fine-tune your vintage computing terminal experience</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:image {\"id\":396,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-396\"><img  src=\"https://linuximpact.com/media/posts/39/crt-settings-1024x449.jpg\" alt=\"Screen split vertically into two. cool-retro-term on the left, with the setings menu on the right\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/39/responsive/crt-settings-1024x449-xs.webp 300w ,https://linuximpact.com/media/posts/39/responsive/crt-settings-1024x449-sm.webp 480w ,https://linuximpact.com/media/posts/39/responsive/crt-settings-1024x449-md.webp 768w ,https://linuximpact.com/media/posts/39/responsive/crt-settings-1024x449-lg.webp 1024w ,https://linuximpact.com/media/posts/39/responsive/crt-settings-1024x449-xl.webp 1360w ,https://linuximpact.com/media/posts/39/responsive/crt-settings-1024x449-2xl.webp 1600w\"></figure></figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>Early monitors had their quirks. Monochrome screens for instance, and weird lines that floated up and down the screen. Fuzzy text, burn-in. cool-retro-term recreates these faithfully.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Launch the app from your start menu or regular console, and you'll see glowing orange text on a brown background, complete with the bezel of the curved monitor on which your terminal is supposed to be running. A slow drifting line changes the hue as it lazily progresses down the screen, and static noise hints at electromagnetic interference - or possibly a dodgy tuner. There's a slight flicker. Welcome to the 1980s.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Of course, you may want your session to be more or less immersive, and if you want to alter of fine-tune any of these special effects it's easy to do:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Right-click anywhere in the interface to bring up the context menu, then click on <strong>Settings</strong>. Under <strong>Effects</strong>, you'll see checkboxes and sliders for everything from screen curve and flickering, to ambient light, jitter, and burn-in. You can adjust these to your satisfaction or turn them off altogether.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Under the <strong>Advanced </strong>tab, you can enhance the realism by adjusting the quality of the textures, bloom and burn-in, as well as changing the frame rate of the effects. Yes, your virtual monitor can flicker and jitter with a realism of 60 FPS, but that kind of defeats the point.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-modern-utilities-in-a-vintage-environment\" class=\"wp-block-heading\">Modern utilities in a vintage environment</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p>The great thing about about using cool-retro-term is that you can use it just like a regular terminal. Edit your conf files in nano, view images with ImageMagick, create markdown documents, and write HTML for your website or blog.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Whatever you do, it will exude a kind of ineffable cyberpunk cool. It's like using the terminals in a video game, but for real, and important stuff. You're the protagonist in Fallout, or your own 80s movie. You'll find yourself frequenting coffee shops in the hope that someone will look over your shoulder and see just how excessively cool you are.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-run-some-classic-games-in-your-retro-terminal\" class=\"wp-block-heading\">Run some classic games in your retro terminal</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:image {\"id\":391,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-391\"><img  src=\"https://linuximpact.com/media/posts/39/colossal-ibm-1024x512.jpg\" alt=\"colossal cave adventure on cool retro term with an emulated black and white IBM screen\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/39/responsive/colossal-ibm-1024x512-xs.webp 300w ,https://linuximpact.com/media/posts/39/responsive/colossal-ibm-1024x512-sm.webp 480w ,https://linuximpact.com/media/posts/39/responsive/colossal-ibm-1024x512-md.webp 768w ,https://linuximpact.com/media/posts/39/responsive/colossal-ibm-1024x512-lg.webp 1024w ,https://linuximpact.com/media/posts/39/responsive/colossal-ibm-1024x512-xl.webp 1360w ,https://linuximpact.com/media/posts/39/responsive/colossal-ibm-1024x512-2xl.webp 1600w\"></figure></figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>While you can do virtual everything you'd normally do in cool-retro-term, we feel you'd be missing out if you didn't fully embrace the nostalgia by running some cool retro games. We'd especially recommend <a href=\"https://linuximpact.com/play-the-first-ever-text-adventure-game-in-your-linux-terminal/\" data-type=\"post\" data-id=\"384\">Colossal Cave Adventure</a> - the world's first text adventure.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><!-- /wp:paragraph --></p>",
            "image": "https://linuximpact.com/media/posts/39/bill-bailey-ibm-dos-cool-retro-term.jpg",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Terminal",
                   "Software",
                   "CLI"
            ],
            "date_published": "2023-11-09T18:53:00+00:00",
            "date_modified": "2023-11-10T17:33:26+00:00"
        },
        {
            "id": "https://linuximpact.com/how-to-install-the-latest-version-of-docker-compose-on-linux-and-why-you-should/",
            "url": "https://linuximpact.com/how-to-install-the-latest-version-of-docker-compose-on-linux-and-why-you-should/",
            "title": "How to install the latest version of Docker Compose on Linux (and why you should)",
            "summary": "It's an understatement to say that Linux has a diverse software ecosystem. No two distros are identical, and each person's setup is unique to them in terms of both software and hardware. While this is great if you want to express your individuality and indulge&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>It's an understatement to say that Linux has a diverse software ecosystem. No two distros are identical, and each person's setup is unique to them in terms of both software and hardware.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>While this is great if you want to express your individuality and indulge your curiosity by running the latest niche project on DistroWatch, it makes it difficult for developers to create software for a standard Linux environment - because there isn't one.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>All software has dependencies that you need to have installed on your system before you can install certain packages. What those packages are, and what packages are available to you will vary wildly. If you're too far from 'the norm', or if the versioning isn't quite right, you could end up in dependency hell.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-use-containers-to-create-standard-environments\" class=\"wp-block-heading\">Use containers to create standard environments</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p>Containerisation is the solution to situations where managing dependencies can become excessively complex, problematic, and error-prone.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Instead of creating and releasing a single app, developers while produce a container that includes everything the app needs to run. This can include pre-configured databases, dependencies pinned to a certain version, or even full-blown operating system bases.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>While there are many container orchestration tools, Docker is the most commonly used, and the ancillary project, Docker Compose, allows you to define and run multi-container Docker applications. With Docker compose, you can manage any number of local or web-facing applications, with nothing more than a simple markup file, and some easy-to-recall commands.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-install-docker-on-debian-ubuntu-and-raspberry-pi-os\" class=\"wp-block-heading\">Install Docker on Debian, Ubuntu, and Raspberry Pi OS</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p>Docker is available in the standard repositories, and there are rarely any breaking changes from the most recent version (at least we've never heard of any ). To install Docker on any Debian derived system, open a terminal, and enter</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><code>sudo apt install docker.io</code></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Docker runs as a privileged daemon, with root powers. You'll need to add your user to the Docker group in order to summon it:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><code>sudo usermod -aG docker your_username</code></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Now log out and back in again for the changes to take effect</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-dont-install-docker-compose-from-the-default-repository\" class=\"wp-block-heading\">Don't install Docker Compose from the default repository!</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:image {\"id\":377,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-377\"><img  src=\"https://linuximpact.com/media/posts/38/flaming-shipwreck-1024x512.jpg\" alt=\"A sailing boat on file at a dock. The dock is also on fire\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/38/responsive/flaming-shipwreck-1024x512-xs.webp 300w ,https://linuximpact.com/media/posts/38/responsive/flaming-shipwreck-1024x512-sm.webp 480w ,https://linuximpact.com/media/posts/38/responsive/flaming-shipwreck-1024x512-md.webp 768w ,https://linuximpact.com/media/posts/38/responsive/flaming-shipwreck-1024x512-lg.webp 1024w ,https://linuximpact.com/media/posts/38/responsive/flaming-shipwreck-1024x512-xl.webp 1360w ,https://linuximpact.com/media/posts/38/responsive/flaming-shipwreck-1024x512-2xl.webp 1600w\"></figure></figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>Docker compose is a different kettle of fish entirely, and while most projects will run just fine if you install Docker Compose with:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>sudo apt install docker-compose</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Some won't, and we've seen an increasing number of failures where deploying a project requires excessive workarounds. Rather than an orderly cargo port, you're faced with a burning shipwreck instead.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>If you're running into inexplicable problems with deploying apps when using a repo-installed version of Docker Compose, first uninstall it:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>sudo apt remove docker-compose</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Visit the Docker Compose GitHub releases page, scroll down to <strong>Assets</strong>, and locate the correct package for your system architecture.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:image {\"id\":376,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-376\"><img  src=\"https://linuximpact.com/media/posts/38/docker-compose-releases-1-1024x453.jpg\" alt=\"Assets section of the docker-compose releases page showing linux packages\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/38/responsive/docker-compose-releases-1-1024x453-xs.webp 300w ,https://linuximpact.com/media/posts/38/responsive/docker-compose-releases-1-1024x453-sm.webp 480w ,https://linuximpact.com/media/posts/38/responsive/docker-compose-releases-1-1024x453-md.webp 768w ,https://linuximpact.com/media/posts/38/responsive/docker-compose-releases-1-1024x453-lg.webp 1024w ,https://linuximpact.com/media/posts/38/responsive/docker-compose-releases-1-1024x453-xl.webp 1360w ,https://linuximpact.com/media/posts/38/responsive/docker-compose-releases-1-1024x453-2xl.webp 1600w\"></figure></figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>If you're not sure, you can find out your system architecture by typing:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>uname -m</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>...into a terminal.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>In the case of our 64-bit Raspberry Pi 4B, this command will return <strong>aarch64</strong>, so we'd look for the <strong>docker-compose-linux-aarch64</strong> package.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>If you have a modern desktop or laptop, it's likely that you need <strong>docker-compose-linux-x86_64</strong>.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Download the relevant package, locate it in your terminal, then move it into your path:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>mv docker-compose* /usr/local/bin/docker-compose</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Now make it executable with:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>sudo chmod +x /usr/local/bin/docker-compose</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>That's all you need to do. You now have the most recent Docker Compose version installed!</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Use it to install and run some awesome self-hosted projects such as <a href=\"https://linuximpact.com/install-immich-on-a-raspberry-and-replace-google-photos/\" data-type=\"post\" data-id=\"282\">Immich</a> - a better <a href=\"https://linuximpact.com/immich-is-the-killer-app-that-will-kick-start-the-self-hosting-revolution/\" data-type=\"post\" data-id=\"293\">self-hosted Google Photos alternative</a>, or <a href=\"https://linuximpact.com/self-host-your-own-audio-library-with-audiobookshelf/\" data-type=\"post\" data-id=\"225\">host your own audiobook library with Audiobookshelf</a>!</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><!-- /wp:paragraph --></p>",
            "image": "https://linuximpact.com/media/posts/38/docked.jpg",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Tips",
                   "Terminal",
                   "Software",
                   "CLI"
            ],
            "date_published": "2023-11-08T10:28:16+00:00",
            "date_modified": "2023-11-10T16:57:30+00:00"
        },
        {
            "id": "https://linuximpact.com/cheap-portable-retro-gaming-with-a-hated-handheld/",
            "url": "https://linuximpact.com/cheap-portable-retro-gaming-with-a-hated-handheld/",
            "title": "Cheap portable retro-gaming with a hated handheld",
            "summary": "If you were a kid in the early 1990s, you'll remember the gaming revolution that was the Nintendo Game Boy. Sure, there were portable gaming systems before - the Game &amp; Watch in particular springs to mind - but these were single game units. You&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>If you were a kid in the early 1990s, you'll remember the gaming revolution that was the Nintendo Game Boy. Sure, there were portable gaming systems before - the Game &amp; Watch in particular springs to mind - but these were single game units. You could play Donkey Kong or Chef, or if you were really swish, the double screened Super Mario Bros.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>But you could play thousands of titles on a Game Boy - thanks to its cartridge system that meant you were, in essence, carrying a console in your pocket.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Later Game Boy models and other manufacturers brought handheld gaming into the mainstream, and it was rare to see a classroom without a few suspiciously bulging pockets stuffed with GBAs, PSPs, and who can can forget the Sega Game Gear? (Answer: everyone).</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:image {\"id\":356,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-356\"><img  src=\"https://linuximpact.com/media/posts/37/coke-game-gear-1024x518.jpg\" alt=\"A red sega Game gear with Coca Cola Branding\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/37/responsive/coke-game-gear-1024x518-xs.webp 300w ,https://linuximpact.com/media/posts/37/responsive/coke-game-gear-1024x518-sm.webp 480w ,https://linuximpact.com/media/posts/37/responsive/coke-game-gear-1024x518-md.webp 768w ,https://linuximpact.com/media/posts/37/responsive/coke-game-gear-1024x518-lg.webp 1024w ,https://linuximpact.com/media/posts/37/responsive/coke-game-gear-1024x518-xl.webp 1360w ,https://linuximpact.com/media/posts/37/responsive/coke-game-gear-1024x518-2xl.webp 1600w\"></figure>\n<figcaption class=\"wp-element-caption\">Not everything goes better with Coke | Credit: <a href=\"https://commons.wikimedia.org/wiki/File:Coca_Cola_Game_Gear_(8567377373).jpg\">Chapuisat from España</a>, <a href=\"https://creativecommons.org/licenses/by/2.0\">CC BY 2.0</a>, via Wikimedia Commons</figcaption>\n</figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>With modern phones, everyone has a console in their pocket, and emulators proliferate on the various app stores - allowing the avid retro-gamer access to legendary Game Boy games, and console classics through to the 2000s.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>But gaming on a phone is soulless. and no touchscreen can ever compare to the solid tactility of real buttons. Yes, you can buy<a href=\"https://www.amazon.com/Android-PC-Nintendo-Switch-PS4-iOS/dp/B0CGCJXSLX?&amp;_encoding=UTF8&amp;tag=thecrowuk-20&amp;linkCode=ur2&amp;linkId=efb0ce1827f7c159766948a7a066bd74&amp;camp=1789&amp;creative=9325\"> phone attachments to give you joypad-like controls</a>, but it's not the same.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-parents-loved-the-leapster-gs-kids-not-so-much\" class=\"wp-block-heading\">Parents loved the Leapster. Kids? Not so much.</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:image {\"id\":357,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-357\"><img  src=\"https://linuximpact.com/media/posts/37/pink-leapster-1024x512.jpg\" alt=\"A small boy wearing headphones with a pink Leapster. A parent watches on. \" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/37/responsive/pink-leapster-1024x512-xs.webp 300w ,https://linuximpact.com/media/posts/37/responsive/pink-leapster-1024x512-sm.webp 480w ,https://linuximpact.com/media/posts/37/responsive/pink-leapster-1024x512-md.webp 768w ,https://linuximpact.com/media/posts/37/responsive/pink-leapster-1024x512-lg.webp 1024w ,https://linuximpact.com/media/posts/37/responsive/pink-leapster-1024x512-xl.webp 1360w ,https://linuximpact.com/media/posts/37/responsive/pink-leapster-1024x512-2xl.webp 1600w\"></figure>\n<figcaption class=\"wp-element-caption\">Credit: <a href=\"https://commons.wikimedia.org/wiki/File:Leapster_2.jpg\">Lana</a>, <a href=\"https://creativecommons.org/licenses/by/2.0\">CC BY 2.0</a></figcaption>\n</figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>The teens of the 90s became the parents of the 2010s, and to paraphrase Red Dwarf's Dave Lister, became sensible, reliable, and other words ending with -ible.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Sure, they remembered the pocketable joys of the Game Boy, as well as the cartoonish violence available on other consoles, and they thought to themselves, \"Why not give our children the same as we had, but more educational and less fun?\"</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>And thus was born the Leapfrog Leapster series of handheld consoles. The Leapster GS entered the world in 2012, and for a handheld kids' toy had fairly decent specs. Internal storage was measured in the low gigabytes, and its 500 MHz processor meant that it was, in theory, more powerful than Sony's still-in-production Playstation 2. The screen, though small, was a usable touchscreen and stylus, with good colour even in broad daylight. It had buttons and a D-pad designed for gaming. There was even a camera!</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Like the Game Boy series, Leapster GS games came on a cartridge. Unlike Nintendo's offerings, the games were Flash-based, and exclusively angled towards educating children between the ages of four and nine. Remember Flash? It powered most of the games on the internet for a while, and is now lost to the sands of history.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:image {\"id\":358,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-358\"><img  src=\"https://linuximpact.com/media/posts/37/leapster-gs-page-1024x505.jpg\" alt=\"official Leapfrog sales page for the Leapster GS showing the official MRSP of $9.99\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/37/responsive/leapster-gs-page-1024x505-xs.webp 300w ,https://linuximpact.com/media/posts/37/responsive/leapster-gs-page-1024x505-sm.webp 480w ,https://linuximpact.com/media/posts/37/responsive/leapster-gs-page-1024x505-md.webp 768w ,https://linuximpact.com/media/posts/37/responsive/leapster-gs-page-1024x505-lg.webp 1024w ,https://linuximpact.com/media/posts/37/responsive/leapster-gs-page-1024x505-xl.webp 1360w ,https://linuximpact.com/media/posts/37/responsive/leapster-gs-page-1024x505-2xl.webp 1600w\"></figure></figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>If you want to buy a spanky new Leapster GS, the Leapfrog website still has them listed for the bargain price of $49.99. Games are limited, pricey, and seldom available from the official source - although you can find <a href=\"https://www.amazon.com/LeapFrog-McStuffins-Learning-Platinum-LeapsterGS/dp/B00D38UBJ6?&amp;_encoding=UTF8&amp;tag=thecrowuk-20&amp;linkCode=ur2&amp;linkId=821c1687ea0c67b6aff2db2e2e67bed9&amp;camp=1789&amp;creative=9325\">Disney Doc McStuffins Learning Game</a> on Amazon for $25.99.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>A quick eBay search shows a moderately active Leapster GS market place, with \"spares and repairs\" items with a Buy It Now price of £5, while at the upper end, a Leapster GS with a carry case and one original game is currently tagged at £45, and it doesn't even have battery packs.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>The advice we'd give is that if you can find a decent one for under £20, bag it - and give it a new lease of life as an emulation station you can fit in your pocket.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-grab-a-used-bargain\" class=\"wp-block-heading\">Grab a used bargain</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p>Given that the Leapster is essentially useless to kids over the age of seven, it's not surprising that they end up being shoved to the back of a drawer until the child eventually leaves home for college, and parents have the unenviable task of sorting through two decades of discarded shit, and deciding what's actually worth keeping.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>If they've been well looked after, artefacts such as the Leapster GS tend to end up in charity shops (The British version of a Thrift store, or possibly GoodWill).</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>We were lucky enough to find an almost perfect example for a fiver in a British Heart Foundation shop near to the Linux Impact mansion. A fiver! OK, so the buttons had lost some of their paint, and it was a bit grimy, but otherwise it was in perfect nick. Even better, the four AA battery slots were filled with rechargeable cells, and it came with a charger. The lack of game cartridges to accompany the unit probably contributed to the price and failed to deter us one iota.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-we-use-arch-btw\" class=\"wp-block-heading\">We use (Retro)Arch BTW</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p>Unlike certain other consoles manufacturers that go to great lengths to ensure lock-in, and that you can't use your Steam library on a PS5, Leapfrog has no such protections in place, meaning that enterprising individuals have taken the time to develop alternate firmware for the device.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Retroleap works on the LeapsterGS and LeapPad2, and combines Retroarch, ARM-optimized emulator cores, and a buildroot root filesystem.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>With Retroleap, converting the Leapfrog Leapster GS from a poorly conceived semi-educational toy to a kickass portable games console didn't take long. The biggest hurdle was finding a compatible cable.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>By the time our pocket pal appeared on the scene, Micro-USB had been the industry standard for five years, so it's kind of baffling that Leapfrog went with the older Mini USB interface. You won't find one in your local supermarket or Poundland, and they were becoming a rarity even in 2012. Fortunately, we never throw a cable away, and after an afternoon sifting through three large bin bags of electronic paraphernalia, were able to locate one that had previously been used with a digital camera.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>After that, it was a case of following the instructions on the <a href=\"https://github.com/mac2612/retroleap\">Retroleap GitHub repo</a>:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Making sure we had the necessary dependencies:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>sudo apt install sg3-utils git python</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Cloning sshflash:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>git clone https://github.com/mac2612/sshflash.git &amp;&amp; cd sshflash</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Downloading and unzipping the latest release into the sshflash directory:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>wget <a href=\"https://github.com/mac2612/retroleap/releases/download/v2.0.0-alpha10/retroleap_v2.0.0-alpha10.zip\">https://github.com/mac2612/retroleap/releases/download/v2.0.0-alpha10/retroleap_v2.0.0-alpha10.zip</a><br><br>unzip retroleap_v2.0.0-alpha10.zip<br><br>rm retroleap_v2.0.0-alpha10.zip</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:image {\"id\":359,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-359\"><img  src=\"https://linuximpact.com/media/posts/37/turning-on-the-leapster-1024x469.jpg\" alt=\"A grimy leapster GS with fingers positioned in an awkward way\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/37/responsive/turning-on-the-leapster-1024x469-xs.webp 300w ,https://linuximpact.com/media/posts/37/responsive/turning-on-the-leapster-1024x469-sm.webp 480w ,https://linuximpact.com/media/posts/37/responsive/turning-on-the-leapster-1024x469-md.webp 768w ,https://linuximpact.com/media/posts/37/responsive/turning-on-the-leapster-1024x469-lg.webp 1024w ,https://linuximpact.com/media/posts/37/responsive/turning-on-the-leapster-1024x469-xl.webp 1360w ,https://linuximpact.com/media/posts/37/responsive/turning-on-the-leapster-1024x469-2xl.webp 1600w\"></figure>\n<figcaption class=\"wp-element-caption\">Did we mention our unit was dirty? This was after some cleaning..</figcaption>\n</figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>Once you have the required files, plug in the Leapster using the antique cable, and flex your fingers, because this part is hard. You have to hold both shoulder buttons, and the hint button, then press the power button. The struggle is real, and if you're anything like us, you'll spoon it completely a few times and end up on the default Leapster menu. If so, start again until you get it right.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>When the screen shows a graphic of a Leapster connected to a PC, you've managed it and can move on.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Flash the new firmware onto the Leapster with:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>./remote_flash.sh</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>That's it. Your Leapster will reboot as an emulation station - capable of playing games designed for the Atari 800, NES, SNES, Sega Megadrive (Genesis), Game Boy, and Game Boy Advance.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-add-some-kick-ass-roms-to-your-leapster-gs\" class=\"wp-block-heading\">Add some kick-ass ROMs to your Leapster GS</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p>You'll be interacting with the Leapster over SSH (Secure Shell), and transferring files using SCP (Secure Copy). The IP address of the Leapster will always be <strong>169.254.6.1</strong></p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>For the sake of your own sanity, you should create some directories on the Leapster to keep things organised.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Our favourite emulator is the for the Megadrive. You can create a directory for your Megadrive ROMs with:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>ssh -i ~/sshflash/keys/id_rsa root@169.254.6.1 'mkdir /roms/megadrive'</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Then transfer your massive archive of homebrew Megadrive ROMS to the new directory with:</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>scp -i ~/sshflash/keys/id_rsa /path/to/your/cool/rom.md root@169.254.6.1:/roms/megadrive/</code></pre>\n<p><!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>It's that simple, and you can work out the button layout yourself.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 id=\"h-the-yoof-of-today\" class=\"wp-block-heading\">The yoof of today</h2>\n<p><!-- /wp:heading --></p>\n<p><!-- wp:image {\"id\":360,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-360\"><img  src=\"https://linuximpact.com/media/posts/37/mk-leapster-1024x512.jpg\" alt=\"A fight between Cyrax and Reptile in Ultimate Mortal Kombat 3 on the Leapster GS\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/37/responsive/mk-leapster-1024x512-xs.webp 300w ,https://linuximpact.com/media/posts/37/responsive/mk-leapster-1024x512-sm.webp 480w ,https://linuximpact.com/media/posts/37/responsive/mk-leapster-1024x512-md.webp 768w ,https://linuximpact.com/media/posts/37/responsive/mk-leapster-1024x512-lg.webp 1024w ,https://linuximpact.com/media/posts/37/responsive/mk-leapster-1024x512-xl.webp 1360w ,https://linuximpact.com/media/posts/37/responsive/mk-leapster-1024x512-2xl.webp 1600w\"></figure></figure>\n<p><!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>It's hard to describe the look of disdain that comes over the faces of various nephews and nieces who visit Linux Impact Towers and see the author sitting on the couch playing on a Leapster GS.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>The junior relatives are aged between five and ten, and all of them have seen Leapsters before. Some have even owned them, and they know the console as underwhelming, something their parents want them to have, and even the younger ones think its for babies. They'd rather have a Game Boy or a Switch.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>They are shocked, nay, awed, when I hand it over just in time for them to see and hear a legendary finishing move on Ultimate Mortal Kombat 3, battle through the jungles of Donkey Kong Country, unleash lightning as a god in Street Fighter 2 Turbo, or explore the world in The Legend of Zelda: A Link to the Past - arguably the greatest console game of all time.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>But is a humble Leapster GS running RetroLeap the GOAT?</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>We'd argue that yes it is. While mainstream, proper handheld consoles can run RetroArch, run the exact same games as RetroLeap, output to a TV, AND have their own exclusive titles, the price is a drawback. A top end OLED model <a href=\"https://www.amazon.com/Nintendo-Switch-OLED-Model-Neon-Joy/dp/B098RL6SBJ/ref=sr_1_2?crid=1CALE3PJL84YL&amp;keywords=nintendo+switch&amp;qid=1699364373&amp;sprefix=nintendo+switch%252Caps%252C169&amp;sr=8-2&amp;_encoding=UTF8&amp;tag=thecrowuk-20&amp;linkCode=ur2&amp;linkId=3fdc3efabd96b7d4e7147bba7405975e&amp;camp=1789&amp;creative=9325\">Nintendo Switch</a> will set you back $350, while a basic <a href=\"https://www.amazon.com/Nintendo-Switch-Lite-Turquoise-Renewed/dp/B081XLXZ4P/ref=sr_1_9?crid=1CALE3PJL84YL&amp;keywords=nintendo+switch&amp;qid=1699364373&amp;sprefix=nintendo+switch%252Caps%252C169&amp;sr=8-9&amp;_encoding=UTF8&amp;tag=thecrowuk-20&amp;linkCode=ur2&amp;linkId=550285411a6dd386c496ca68b4da86d6&amp;camp=1789&amp;creative=9325\">\"renewed\" Switch Lite</a> comes in at $175. It's hardly pocket money, and your average eight-year-old will have a much harder time convinced a parent or relative that it's a necessary purchase.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>But to indulge your kids with a $5 or $10 purchase, and a library of thousands of essentially free games is a different proposition altogether.</p>\n<p><!-- /wp:paragraph --></p>",
            "image": "https://linuximpact.com/media/posts/37/mk-on-leapster-gs.jpg",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Linux",
                   "Hardware",
                   "Gaming",
                   "DIY"
            ],
            "date_published": "2023-11-07T14:49:34+00:00",
            "date_modified": "2023-11-10T17:35:50+00:00"
        },
        {
            "id": "https://linuximpact.com/discover-your-most-used-linux-commands-with-muc/",
            "url": "https://linuximpact.com/discover-your-most-used-linux-commands-with-muc/",
            "title": "Discover your most used Linux commands with MUC",
            "summary": "Life with Linux is all about the command line. While it's true that there are thousands of awesome distros and dozens of beautiful desktop environments, when it comes down to it, the Linux terminal is where things actually get done. Whether it's transferring files to&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>Life with Linux is all about the command line. While it's true that there are thousands of awesome distros and dozens of beautiful desktop environments, when it comes down to it, the Linux terminal is where things actually get done.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Whether it's transferring files to your Raspberry Pi server using SCP, creating config files, or setting up your own Google Photos alternative, you will, more often than not, find yourself elbows deep in a black screen typing commands.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>But do you ever wonder what commands you type most often? If we had to hazard a guess, we'd say that our most commonly used Linux command is some variant of <strong>ls</strong> - the command to list the contents of a directory - but we don't know for sure.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>We're curious though, and if you, like us, are desperate to discover your top commands, along with some ancillary information, and presented in a beautiful terminal window, muc (Most Used Commands) is the terminal tool for you.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 class=\"wp-block-heading\" id=\"h-why-would-you-want-to-know-your-most-frequently-used-terminal-commands\">Why would you want to know your most frequently used terminal commands?</h2>\n<p>\n<!-- /wp:heading --></p>\n<p><!-- wp:image {\"id\":346,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-346\"><img src=\"https://linuximpact.com/media/posts/36/typing-hands-1024x512.jpg\" alt=\"hands typing on a laptop keyboard\"  sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/36/responsive/typing-hands-1024x512-xs.webp 300w ,https://linuximpact.com/media/posts/36/responsive/typing-hands-1024x512-sm.webp 480w ,https://linuximpact.com/media/posts/36/responsive/typing-hands-1024x512-md.webp 768w ,https://linuximpact.com/media/posts/36/responsive/typing-hands-1024x512-lg.webp 1024w ,https://linuximpact.com/media/posts/36/responsive/typing-hands-1024x512-xl.webp 1360w ,https://linuximpact.com/media/posts/36/responsive/typing-hands-1024x512-2xl.webp 1600w\"></figure></figure>\n<p>\n<!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>How about arthritis?</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>This may sound fatuous (it kinda is), but typing puts wear and tear on your fingers and joints, and often the command strings you use can be wordy. If you find out what commands you use most, you can create a short, easy-to-remember alias, and use that instead.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Also, data is beautiful. But until you have the data you can't do anything with it.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 class=\"wp-block-heading\" id=\"h-how-to-install-muc-on-linux\">How to install muc on Linux</h2>\n<p>\n<!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p>muc is written with the Rust language, and while muc is available in the AUR (Arch User Repository), it isn't included in the standard repositories for any distro. The easiest way to install it is with Cargo.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>If you don't already have Rust and Cargo on your system, the devs recommend using a script to install it. Open a terminal, and enter:</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>curl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh </code></pre>\n<p>\n<!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Once that's out of the way, you can install muc with:</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>cargo install --git=https://github.com/nate-sys/muc</code></pre>\n<p>\n<!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Downloading, compiling, and installing muc took under a minute on our laptop, but significantly longer on the Linux Impact Raspberry Pi server.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:heading --></p>\n<h2 class=\"wp-block-heading\" id=\"h-use-muc-to-reveal-you-most-used-commands\">Use muc to reveal you most used commands</h2>\n<p>\n<!-- /wp:heading --></p>\n<p><!-- wp:image {\"id\":345,\"sizeSlug\":\"large\",\"linkDestination\":\"none\"} --></p>\n<figure class=\"wp-block-image size-large\"><figure class=\"wp-image-345\"><img src=\"https://linuximpact.com/media/posts/36/muc-output-1024x489.jpg\" alt=\"Linux terminal showing muc output with percentages and a bar graph\"  sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/36/responsive/muc-output-1024x489-xs.webp 300w ,https://linuximpact.com/media/posts/36/responsive/muc-output-1024x489-sm.webp 480w ,https://linuximpact.com/media/posts/36/responsive/muc-output-1024x489-md.webp 768w ,https://linuximpact.com/media/posts/36/responsive/muc-output-1024x489-lg.webp 1024w ,https://linuximpact.com/media/posts/36/responsive/muc-output-1024x489-xl.webp 1360w ,https://linuximpact.com/media/posts/36/responsive/muc-output-1024x489-2xl.webp 1600w\"></figure></figure>\n<p>\n<!-- /wp:image --></p>\n<p><!-- wp:paragraph --></p>\n<p>Once muc is installed, you can launch the program by typing:</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>muc</code></pre>\n<p>\n<!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>...into any terminal.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>By default, muc will use your bash history for its analysis. If it can't find the file, muc may throw an error with the message, \"Could not find HISTFILE environment variable. Supply the file path with the --file option\".</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>By default, your history file is located at ~/.bash-history</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>To get the full path, enter:</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>echo $HISTFILE</code></pre>\n<p>\n<!-- /wp:code --></p>\n<p><!-- wp:paragraph --></p>\n<p>Now relaunch muc with the --file option, for instance:</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:code --></p>\n<pre class=\"wp-block-code\"><code>muc --file /path/to/your/history file</code></pre>\n<p>\n<!-- /wp:code --></p>\n<p><!-- wp:heading --></p>\n<h2 class=\"wp-block-heading\" id=\"h-linux-impacts-most-used-commands\">Linux Impact's most used commands</h2>\n<p>\n<!-- /wp:heading --></p>\n<p><!-- wp:paragraph --></p>\n<p>As expected our most used command was ls - accounting for more than one quarter of all commands issued. This was followed by <strong>cd</strong>, which accounted for a further fifth.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Next up was <strong>sudo</strong>, with a range of privileged commands such as <strong>apt</strong>, <strong>dpkg</strong>, and <strong>reboot</strong>.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Further down the list were further file operations, including <strong>scp</strong>, <strong>mv</strong>, and <strong>cp</strong>. This feels about right, as we tend to use the terminal in place of a file manager.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><strong>ssh</strong> is also fairly high on the list as we spend a lot of time interacting with remote machines.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Finally, we have <strong>yt-dlp</strong> for downloading streaming media, and <strong>tiv</strong>, which we use as part of a script to fetch images from a remote server and display them in a terminal in the corner of our primary workspace.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Over on the Pi, the picture was slightly different. While <strong>ls,</strong> <strong>sudo</strong>, and file operation commands still topped the list, we found a fair bit devoted to <strong>docker</strong>, <strong>nano</strong>, and various system monitoring tools.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Having satisfied our curiosity, and created various three-letter aliases for docker-compose operations, we resolved to check in with muc in a few months time to see if our usage had changed. </p>\n<p>\n<!-- /wp:paragraph --></p>\n",
            "image": "https://linuximpact.com/media/posts/36/word-cloud.jpg",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Tips",
                   "Terminal",
                   "TUI",
                   "Software",
                   "Linux",
                   "CLI"
            ],
            "date_published": "2023-11-06T14:27:17+00:00",
            "date_modified": "2023-11-10T11:17:44+00:00"
        }
    ]
}
